[
  {
    "hearing_date": "April 24, 2025",
    "petition_number": "24-101",
    "decision": "The Board unanimously upheld the Assessor's value; no value reduction.",
    "value_reduction": 0,
    "notes": "Owner: Dennis & Beverly Weathers. Parcel No: P34089. Property: residential on ~0.86 acres located at 7071 Worline Road, Bow, WA 98232. Assessor's Value - Land: $264,000; Improvements: $510,600; Total: $774,600. BOE Value Determination matches these amounts. The petitioner was not present at the April 24, 2025 hearing. The Board found the petitioner did not present sufficient evidence to warrant a reduction. Dated: April 28, 2025. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-101.pdf_page1.png"
  },
  {
    "hearing_date": "March 27, 2025",
    "petition_number": "24-145",
    "decision": "BOE upheld the assessor's value; no reduction",
    "value_reduction": 0,
    "notes": "Owner: Hola Revocable Living Trust; Property: 33398 West Shore Drive, Mount Vernon, Skagit County, Washington. Parcel No: P66939. Assessor's Value: Land $497,100; Improvements $750,300; Total $1,247,400. BOE Value Determination: Land $497,100; Improvements $750,300; Total $1,247,400. The petitioner was not present at the March 27, 2025 hearing. The property is described as a residential home on 0.38 acres. The burden of proof lies with the petitioner; Board unanimously upholds the Assessor. Dated: April 7, 2025. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-145.pdf_page1.png"
  },
  {
    "hearing_date": "null",
    "petition_number": "null",
    "decision": "null",
    "value_reduction": 0,
    "notes": "No hearing-specific data found in the provided image. The image appears to be a navigation page (Main Menu / Directory) with links, not a hearing record. Unable to extract hearing_date, petition_number, owner_name, property_address, or a decision/value_reduction from this image.",
    "source_file": "24-094.pdf_page4.png"
  },
  {
    "hearing_date": "April 9, 2025",
    "petition_number": "24-220",
    "decision": "Board overruled the assessor and assigned a new assessed value of $1,580,000",
    "value_reduction": 50000,
    "notes": "Parcel No: P83271. Assessor's value: Land $536,500; Improvements $1,093,500; Total $1,630,000. BOE value determination: Land $536,500; Improvements $1,043,500; Total $1,580,000. The petitioner was not present at the April 1, 2025 hearing. Property described as a residential home on 0.47 acres located at 18615 W Big Lake Blvd, Mount Vernon, Skagit County, Washington. The appraiser notes mention structure requires $35K for plywood and roof due to mold and rot. The Board overruled the Assessor and assigned a new assessed value of $1,580,000. Dated: April 9, 2025. Signatures: Rich Holtorp, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-220.pdf_page1.png"
  },
  {
    "hearing_date": "February 20, 2025",
    "petition_number": "24-187 & 24-188",
    "decision": "No reductions granted; Board sustained the assessor's values for all parcels; petitioner did not overcome the evidentiary standard to overrule the assessor.",
    "value_reduction": 0,
    "notes": "Petitioner: Stephen Sziebert; Petition No. 24-187 & 24-188; Parcels: P20371, P113469, P113470. Address: 3918 H Avenue, Anacortes, WA 98221. Hearing date: February 20, 2025; Order date: March 3, 2025. Property described as three parcels near Gibraltar Road, Anacortes, Skagit County, WA. Assessor's values: P20371 – Land 334300; Total 334300; P113469 – Land 284100; Total 284100; P113470 – Land 71200; Total 71200. BOE values matched assessor's values (no reductions). The petitioner was present at the hearing. The Board found the petitioner failed to overcome the evidentiary standard necessary to overrule the assessor. Board members present: Rich Holtrop, Angie Bossarte, Betta Spinelli.",
    "source_file": "24-187.pdf_page1.png"
  },
  {
    "hearing_date": "March 4, 2025",
    "petition_number": "24-175",
    "decision": "Board unanimously upholds the Assessor's valuation; no reduction.",
    "value_reduction": 0,
    "notes": "Owner: Seth Kiser. Property: 13440 Satterlee Road, Anacortes, WA 98221 (Parcel No: P125060). Assessed values—Land $224,000; Improvements $937,500; Total $1,161,500. Petitioner was not present at the February 20, 2025 hearing. Property described as a residential home on 1 acre; located in Skagit County, WA; under construction; shop not finished; landscape not complete; issues cited regarding comparison to finished homes. The Assessor, represented by Deputy Assessor Brian Herring and Doug Webb, provided supporting evidence for the current assessment; Board sustained the current evaluation. BOE members present: Rich Holtrop (Chair), Angie Bossarte, Betta Spinelli. Upon motion, the Board unanimously upheld the Assessor.",
    "source_file": "24-175.pdf_page1.png"
  },
  {
    "hearing_date": "March 27, 2025",
    "petition_number": "24-146",
    "decision": "The Skagit County Board of Equalization upheld the Assessor's value (BOE value determination).",
    "value_reduction": 0,
    "notes": "Owner: Geivett Investments LLC. Property: 35035 S Shore Drive, Mount Vernon, WA 98274. Parcel No: P122539. The petitioner, Greta Geivett, was not present at the March 27, 2025 hearing. Assessed values: LAND $563,100; IMPROVEMENTS $1,217,900; TOTAL $1,781,000 (identical to BOE determination). The appellant cited a third-party appraisal (Robert Bodkin #1702350, 9/6/2024) suggesting a lower value. The Assessor, represented by Deputy Assessor Brian Herring and Doug Webb, requested the Board sustain the current evaluation. Board members present: Rich Holtrop, Betta Spinelli, John Rantschler. Order date: April 8, 2025. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-146.pdf_page1.png"
  },
  {
    "hearing_date": "February 24, 2025",
    "petition_number": "24-026",
    "decision": "Board unanimously upheld the Assessor's value (no reduction).",
    "value_reduction": 0,
    "notes": "Petitioner not present at the February 13, 2025 hearing. Property described as a residential home on 2.38 acres located at 11198 Whistle Lake Road, Anacortes, Skagit County, WA. Assessors values: Land $277,200; Improvements $1,090,100; Total $1,367,300. BOE value determination matches the assessor's. Petitioner submitted market data and comparable sales; Board found the evidence insufficient to overcome the evidentiary standard. Sales cited by petitioner include 15606 Beaver Marsh Road (sold 7/28/23 for $850,000) and 14293 Rosario Rd (sold 4/24/24 for $1,272,000). Assessor utilized eight comparable sales, including one sale provided by the petitioner; most recent sale of the subject property was $1,140,000 on 11/03/2021. The Board unanimously upheld the assessor.",
    "source_file": "24-026.pdf_page1.png"
  },
  {
    "hearing_date": "2025-02-13",
    "petition_number": "24-057",
    "decision": "Board unanimously upholds the Assessor (no change in value).",
    "value_reduction": 0,
    "notes": "Owner: Christopher Staff. Property: vacant land parcel of .89 acres located at 15773 South Deception Shores Drive, Anacortes, Skagit County, Washington. Parcel No.: P118303. Assessor's Value: $296,900 (land). BOE Value Determination: $296,900 (land). The petitioner was not present at the February 13, 2025 hearing. Order dated February 24, 2025.",
    "source_file": "24-057.pdf_page1.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "",
    "value_reduction": 0,
    "notes": "Image appears blank or unreadable; no extractable data (no owner_name, property_address, petition_number, hearing_date, or decision available).",
    "source_file": "24-036.pdf_page2.png"
  },
  {
    "hearing_date": "January 16, 2025",
    "petition_number": "24-082",
    "decision": "Board upheld the Assessor's valuation; no value reduction granted. Assessed values: Land $290,400; Improvements $681,900; Total $972,300 (BOE value determination same as Assessor).",
    "value_reduction": 0,
    "notes": "Petitioner: Gary Christopher. Property: 4701 Schooner Drive, Anacortes, WA 98221. Parcel No: P131004. The petitioner was not present at the hearing. Residential property on ~0.11 acres. Board members: Rich Holtrop, Angie Bossarte, Betta Spinelli. The Board found the evidence insufficient to reduce the assessed value.",
    "source_file": "24-082.pdf_page1.png"
  },
  {
    "hearing_date": "2025-03-06",
    "petition_number": "24-222",
    "decision": "Board unanimously upheld the Assessor's valuation; no reduction; current valuation sustained at $83,100.",
    "value_reduction": 0,
    "notes": "Petitioner was not present at the March 6, 2025 hearing. Property is a residential parcel of .53 acres, known as Tract 1 of Lone Tree Lots, LaConner, WA, Skagit County, Washington. The appraiser notes the property has no sewer available; there would be significant cost to installing a septic system. There is no access to public water and the lot lies ~100 feet from the reef point community well and approximately 150 feet from a second well. The property is undeveloped in its current state. Assessor's values: Land $83,100; Improvements $0; Total $83,100. BOE value determination matches assessor at $83,100. The petitioner did not submit sufficient evidence to support a reduction. Board unanimously upholds the Assessor. BOE members present: Rich Holtrop, Angie Bossarte, Betta Spinelli. Dated: March 17, 2025; Signed Rich Holtrop, Chair; Mailed Crystal Carter, Clerk of the Board.",
    "source_file": "24-222.pdf_page1.png"
  },
  {
    "hearing_date": "February 13, 2025",
    "petition_number": "24-118",
    "decision": "Board upheld the Assessor's valuation; current assessment remains $1,229,000; petition denied; no value reduction.",
    "value_reduction": 0,
    "notes": "Parcel No: P131507. Property: residential home on ~0.17 acres at 2103 29th Place, Anacortes, Skagit County, WA. Owner: Ownwell, Inc. Petitioner: Kevin Kennedy. Hearing date: February 13, 2025; Board order dated February 24, 2025. Assessed values: Land $275,000; Improvements $954,000; Total $1,229,000. Petition sought a reduction of $1,100,000. BOE members present: Rich Holtrop (Chair), Angie Bossarte, Betta Spinelli. Assessor represented by Deputy Assessor Brian Herring and Doug Webb. The Board found the Assessor's market evidence supported the current assessment.",
    "source_file": "24-118.pdf_page1.png"
  },
  {
    "hearing_date": "March 27, 2025",
    "petition_number": "24-182",
    "decision": "The Skagit County Board of Equalization unanimously upheld the Assessor's value; no reduction granted.",
    "value_reduction": 0,
    "notes": "Owner(s): Edward & Margaret Oleksiak. Property: 4823 Beaver Pond Drive South, Mount Vernon, WA 98274 (Parcel No. P123111). Assessed value: Land $155,300; Improvements $769,300; Total $924,600. BOE value determination: same as Assessor. The petitioner was not present at the March 27, 2025 hearing. Property described as residential home on ~0.26 acres. Discussion notes mention a potential $30,000 reduction in home values due to the Eaglemont Golf Course, and a $57,000 increase not warranted, but the Board found no market evidence submitted to support a reduction and upheld the assessor. BOE members present: Rich Holtrop (Chair), Betta Spinelli, John Rantschler. Final action: Board unanimously upholds the Assessor; signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-182.pdf_page1.png"
  },
  {
    "hearing_date": "February 6, 2025",
    "petition_number": "24-325",
    "decision": "Board of Equalization upheld the Assessor's value (no change).",
    "value_reduction": 0,
    "notes": "Parcel No: P57970. Property: residential home on ~0.5 acres located at 4111 R Avenue, Anacortes, Skagit County, WA. Assessor's value: Land $329,000; Improvements $582,800; Total $911,800. BOE value determination: Land $329,000; Improvements $582,800; Total $911,800. The petitioner, Monty Wood, was present at the February 6, 2025 hearing. The Assessor's evidence, presented by Deputy Assessor Doug Webb, supported the current assessment. BOE members present: Rich Holtrop (Chair), Angie Bossarte, Betta Spinelli. The petitioner argued for a reduction, citing past tax values; the Board found insufficient evidence to support a value increase and unanimously upheld the Assessor. The order includes signatures of Rich Holtrop, Chair, and Crystal Carter, Clerk of the Board. Notice of appeal to the State Board of Tax Appeals is available by filing with the Skagit County Assessor's Office or the State Board of Tax Appeals.",
    "source_file": "24-325.pdf_page1.png"
  },
  {
    "hearing_date": "March 10, 2025",
    "petition_number": "24-224",
    "decision": "BOE value determination; new assessed value $575,000 (overruled assessor's total value of $622,600).",
    "value_reduction": 47600,
    "notes": "Petitioner not present at the February 27, 2025 hearing. Property described as a condominium located at 1819 Cedar Springs Lane, Anacortes, Skagit County, WA. Parcel No. 117552. Assessor's values: LAND $275,600; IMPROVEMENTS $347,000; TOTAL $622,600. BOE values: LAND $275,600; IMPROVEMENTS $299,400; TOTAL $575,000. Board overruled the Assessor and assigned a new assessed value of $575,000. Order dated March 10, 2025.",
    "source_file": "24-224.pdf_page1.png"
  },
  {
    "hearing_date": "March 3, 2025",
    "petition_number": "[\"24-337\",\"24-338\"]",
    "decision": "The Skagit County Board of Equalization unanimously upheld the Assessor's value for both parcels; no value reduction.",
    "value_reduction": 0,
    "notes": "Petitioner was not present at the February 20, 2025 hearing. This is a three-parcel property with 0.42 acres and 73' of low bank beachfront located at 15275 Gibralter Road, Anacortes, Skagit County, Washington. The appellant cites market comps; significant capital improvements are required due to deterioration. The Assessor notes that the purchase history shows a family sale without exposure to the market and with below-market-rate financing. The BOE members present were Rich Holtrop, Angie Bossarte, and Betta Spinelli. The burden of proof is on the petitioner to provide clear, cogent evidence to support a reduction; the petitioner did not overcome the evidentiary standard. Purchase history shows a sale of $1,465,000 recorded on 07/03/2024. The Board unanimously upholds the Assessor.",
    "source_file": "24-338.pdf_page1.png"
  },
  {
    "hearing_date": "May 8, 2025",
    "petition_number": "24-359",
    "decision": "Board unanimously upholds the Assessor's valuation (no reduction); Assessed value remains $1,640,500 (Land $495,900; Improvements $1,144,600).",
    "value_reduction": 0,
    "notes": "Petitioner Matt Phillips attended the May 8, 2025 hearing. Property described as a residential property on 19.7 acres located at 30142 Walberg Road, Sedro Woolley, Skagit County, Washington. Current assessed values: Land $495,900; Improvements $1,144,600; Total $1,640,500. The Board found that the evidence presented did not support a reduction of the assessed value, despite arguments regarding maintenance, bids, and a 2023 third-party appraisal. The Board sustained the Assessor's valuation.",
    "source_file": "24-359.pdf_page1.png"
  },
  {
    "hearing_date": "null",
    "petition_number": "null",
    "decision": "null",
    "value_reduction": 0,
    "notes": "The image contains only a general notice about appealing to the State Board of Tax Appeals and provides no specific case details. Missing: hearing_date, petition_number, owner_name, property_address, and decision. No value reduction information is present.",
    "source_file": "24-028.pdf_page2.png"
  },
  {
    "hearing_date": "March 13, 2025",
    "petition_number": "24-019",
    "decision": "Board unanimously upheld the Assessor's value; no reduction granted.",
    "value_reduction": 0,
    "notes": "Owner: Victor & Linda Benson. Property: 19357 Kanako Lane, Mount Vernon, WA 98274. Parcel No: P16592. Assessor's Value: Land $378,800; Improvements $847,600; Total $1,226,400. BOE Value Determination: same as Assessor. The petitioner did not submit sufficient evidence to support a reduction; Board upheld the Assessor. Order date: March 24, 2025. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk.",
    "source_file": "24-019.pdf_page1.png"
  },
  {
    "hearing_date": "April 3, 2025",
    "petition_number": "24-221",
    "decision": "Board of Equalization upheld the Assessors value; total value 545,500; no value reduction",
    "value_reduction": 0,
    "notes": "OWNER: Richard & Emily Rawlings; PARCEL NO: P52837; PROPERTY ADDRESS: 505 W Blackburn Rd, Mount Vernon, WA 98273. The petitioner was not present at the March 20, 2025 hearing. Property described as a residential home on ~0.2 acres located at 505 W Blackburn Road, Mount Vernon, Skagit County, Washington. Assessor's value: Land 206,900; Improvements 338,600; Total 545,500. BOE value determination: Land 206,900; Improvements 338,600; Total 545,500. The Board unanimously upheld the Assessor.",
    "source_file": "24-221.pdf_page1.png"
  },
  {
    "hearing_date": "April 24, 2025",
    "petition_number": "24-239",
    "decision": "Board overruled the Assessor and assigned a new assessed value of $682,400.",
    "value_reduction": 11200,
    "notes": "Petitioner present at the April 24, 2025 hearing. Owner(s): Antoinette & Scott Geene. Property: 801 North Waugh Road, Mount Vernon, WA 98273 (0.36 acres). Parcel No: P83267. The Assessor's total value was $693,600; BOE value determined: $682,400.\"",
    "source_file": "24-239.pdf_page1.png"
  },
  {
    "hearing_date": "March 20, 2025",
    "petition_number": "24-214",
    "decision": "Board upholds the Assessors value (no change to assessed value).",
    "value_reduction": 0,
    "notes": "Owner(s): Zachary & Larissa Kelly. Property: 1700 Fowler Street, Mount Vernon, WA 98273. The petitioner was not present at the March 20, 2025 hearing. The property is described as a residential home on 0.2 acres. Assessed values: LAND $209,300; IMPROVEMENTS $276,400; TOTAL $485,700. BoE value determination mirrored the assessor: LAND $209,300; IMPROVEMENTS $276,400; TOTAL $485,700. Petitioner cited comparable sales (e.g., P79421 -$244,000; P95691 -$460,000; P83576 -$400,000; sales dates 7/25/2024, 1/23/2024, 7/11/2024) and arguments about the housing market, but the burden of proof was not met. The Board, with BOE members Rich Holtrup, Angi Bossarte, and Betta Spinelli, unanimously upheld the assessor. The property was built in 1978; roof is 15 years old.",
    "source_file": "24-214.pdf_page1.png"
  },
  {
    "hearing_date": "March 20, 2025",
    "petition_number": "24-181",
    "decision": "Board of Equalization unanimously upholds the Assessor's valuation; no value reduction.",
    "value_reduction": 0,
    "notes": "Petitioner: Oscar Hernandez; Address: 2307 Cedar Court, Mount Vernon, WA 98273; Parcel No: P80183. Hearing date: March 20, 2025. Property: residential home on 0.19 acres located at 2307 Cedar Court, Mount Vernon, Skagit County, Washington. Assessors' values: Land $210,600; Improvements $223,400; Total $434,000. BOE value determination matched assessor's values (Land $210,600; Improvements $223,400; Total $434,000). The petitioner was present at the hearing. The order date is March 26, 2025; the Board unanimously upheld the assessor. Signatures: Rich Holtrop (Chair) and Crystal Carter (Clerk).",
    "source_file": "24-181.pdf_page1.png"
  },
  {
    "hearing_date": "February 6, 2025",
    "petition_number": "24-174",
    "decision": "Board unanimously upholds the Assessor's value; no reduction granted.",
    "value_reduction": 0,
    "notes": "Owner name: Michael McFarland. Petitioner's address listed: 2314 42nd Place, Anacortes, WA 98221. Property address described: 1910 Kansas Avenue, Anacortes, Skagit County, Washington (0.18 acres, residential home). Parcel No: P113567. Assessor's Value: Land $255,100; Improvements $0; Total $255,100. BOE Value Determination: Land $255,100; Improvements $0; Total $255,100. The petitioner paid $190,000 in 2021; property estimated worth $220,000; located on a steep slope with topographic limitations discussed (house set back and slope impacts). No market evidence or credible reductions provided by petitioner. Burden of proof on petitioner; board found insufficient evidence to support a reduction. Upon motion, the Board unanimously upheld the Assessor. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board. Document date: February 14, 2025.",
    "source_file": "24-174.pdf_page1.png"
  },
  {
    "hearing_date": "2025-04-01",
    "petition_number": "24-137",
    "decision": "Board of Equalization upheld the Assessor's value; no reduction. Assessed value remains $564,700.",
    "value_reduction": 0,
    "notes": "Owner: Gary & Deborah Shupien. Property: 1172 S Spruce Street, Burlington, WA 98233. Parcel No: P62825. Hearing date: April 1, 2025. The petitioner was not present. Property described as residential home on 0.19 acres. Assessor's value: Land $221,400; Improvements $343,300; Total $564,700. Board members: Rich Holtrop (Chair), Betta Spinelli, John Rantschler. The Board unanimously upheld the Assessor; no evidence submitted to justify a reduction.",
    "source_file": "24-137.pdf_page1.png"
  },
  {
    "hearing_date": "March 4, 2025",
    "petition_number": "24-003",
    "decision": "Board upholds assessor's value (no reduction) with a 2-1 vote.",
    "value_reduction": 0,
    "notes": "Petitioner: George Bielitz. Parcel No: P83441. Property: residential home on .46 acres at 11586 Coronado Drive, Anacortes, WA 98221. Assessor's value: Land $288,300; Improvements $773,000; Total $1,061,300. BOE value determination mirrors assessor's values. The petitioner was present at the February 20, 2025 hearing. Board members present: Rich Holtrop, Angie Bossarte, Betta Spinelli. The Board upheld the Assessor two to one. Dated March 4, 2025. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-003.pdf_page1.png"
  },
  {
    "hearing_date": "April 24, 2025",
    "petition_number": "24-191",
    "decision": "BOE sustained the Assessor's valuation; current BOE value $1,390,100 (Land $288,100; Improvements $1,102,000).",
    "value_reduction": 0,
    "notes": "Owner: Donald & Elizabeth Kosa. Property address: 23827 Brightwood Lane, Sedro-Woolley, WA. Parcel No: P50050. Petition No: 24-191. The petitioner was not present at the April 24, 2025 hearing. Header address for petitioner: 4935 Prairie Lane, Sedro Woolley, WA 98284. Description in the record describes the property as residential on 1 acre located at 23827 Brightwood Lane, Sedro Woolley, Skagit County, WA. Assessed value: $1,390,100; BOE value: $1,390,100. The Assessor requested the board sustain the current valuation; there is a note of a prior reduction of $48,640 from a previous appeal. Board members present: Rich Holtrip, Angie Bossarte, Betta Spinelli. Signatures: Rich Holtrip, Chair; Crystal Carter, Clerk of the Board. Order dated April 30, 2025.",
    "source_file": "24-191.pdf_page1.png"
  },
  {
    "hearing_date": "2025-01-30",
    "petition_number": "24-100",
    "decision": "BOE upholds the Assessor's value (no reduction).",
    "value_reduction": 0,
    "notes": "Parcel No: P135564. Property: residential home on 0.34 acres located at 2410 27th Street, Anacortes, Skagit County, WA. Assessor's Value: Land $300,500; Improvements $585,600; Total $886,100. BOE Value Determination: Land $300,500; Improvements $585,600; Total $886,100. Petitioner Justin Von Hagel was present at the January 30, 2025 hearing. The petitioner described market value evidence (claimed $795,000; half the lot usable; listed at $885,000 with no offers). The Assessor was represented by Deputy Assessor Brian Herring and Doug Webb. Board members present: Rich Holtrop (Chair), John Rantschler, Betta Spinelli. The Board found the petitioner failed to provide sufficient evidence to support a reduction and unanimously upheld the Assessor. Dated: (not shown in image). Signed by Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-100.pdf_page1.png"
  },
  {
    "hearing_date": "March 12, 2025",
    "petition_number": "24-028",
    "decision": "Board unanimously upholds the Assessor's value; no reduction granted; BOE value matches Assessor's value (Total 582,000).",
    "value_reduction": 0,
    "notes": "Owner: Jay Ham. Property: 3153 Biz Point Road, Anacortes, WA 98221. Assessor's value - Land: 311,300; Improvements: 270,700; Total: 582,000. BOE determination - Land: 311,300; Improvements: 270,700; Total: 582,000. The petitioner was present (Feb 27, 2025 hearing). The Board sustained the current evaluation.",
    "source_file": "24-028.pdf_page1.png"
  },
  {
    "hearing_date": "March 3, 2025",
    "petition_number": "24-337 & 24-338",
    "decision": "Board unanimously upholds the Assessor's valuation",
    "value_reduction": 0,
    "notes": "Petitioners: Sean & Gretchen Brennan and Steffen & Kristen Nelson. Petition Nos: 24-337 and 24-338. Parcel Nos: P73290 and P73291. This is a three-parcel property with 0.42 acres and 73 ft of low-bank beachfront located at 15275 Gibralter Road, Anacortes, Skagit County, WA. Assessor's values: 24-337 P73290 - LAND $1,001,000; IMPROVEMENTS $653,400; TOTAL $1,654,400. BOE values for 24-337: LAND $1,001,000; IMPROVEMENTS $653,400; TOTAL $1,654,400. 24-338 P73291 - LAND $43,600; IMPROVEMENTS $0; TOTAL $43,600. BOE values for 24-338: LAND $43,600; IMPROVEMENTS $0; TOTAL $43,600. The petitioner was not present at the February 20, 2025 hearing. The purchase history shows a transfer of $1,465,000 recorded July 3, 2024, with below-market-rate financing indicating a family sale. The Board unanimously upheld the Assessor.",
    "source_file": "24-337.pdf_page1.png"
  },
  {
    "hearing_date": "null",
    "petition_number": "null",
    "decision": "null",
    "value_reduction": 0,
    "notes": "The provided image shows a generic notice from Skagit County Board of Equalization about appealing to the State Board of Tax Appeals. It does not contain any hearing-specific data (hearing date, petition number, owner name, property address, or decision/value reduction).",
    "source_file": "24-165.pdf_page2.png"
  },
  {
    "hearing_date": "February 13, 2025",
    "petition_number": "24-241",
    "decision": "Board upholds the Assessor's value (no reduction).",
    "value_reduction": 0,
    "notes": "Parcel: P126722. Petitioner: Carl Ellsworth; Hearing date: February 13, 2025. The petitioner was not present at the February 13, 2025 hearing. Property: residential home on 0.14 acres located at 2715 Geer Lane, Anacortes, Skagit County, WA. Assessor’s value: Land $240,000; Improvements $765,600; Total $1,005,600. BOE value determination mirrors Assessor’s values; The board upheld the Assessor’s values with a 2-1 vote. Dated February 24, 2025; Signed by Rich Holtrop, Chair, and Crystal Carter, Clerk of the Board.",
    "source_file": "24-241.pdf_page1.png"
  },
  {
    "hearing_date": "February 20, 2025",
    "petition_number": "24-079",
    "decision": "Board of Equalization upheld the Assessor's value (no reduction)",
    "value_reduction": 0,
    "notes": "Petitioner: Roxan Kraft; Property: 901 D Avenue, Anacortes, WA 98221 (0.28 acres) - parcel no. P56204. Assessor's reported value: Land $778,000; Improvements $1,835,600; Total $2,613,600. Petitioner requested a reduced value of $2,273,200 (approximately 5-10% reduction mentioned in filing, but the board did not grant it). Hearing noted as February 20, 2025; Board unanimously upheld the current assessor valuation. The petition included references to market evidence and comparable sales; signatures: Rich Holtrup, Chair; Crystal Carter, Clerk of the Board. Date of order: March 4, 2025.",
    "source_file": "24-079.pdf_page1.png"
  },
  {
    "hearing_date": "January 23, 2025",
    "petition_number": "24-177",
    "decision": "Board of Equalization upholds the Assessor's value (BOE unanimously upholds the Assessor).",
    "value_reduction": 0,
    "notes": "Owner: Keith Beeman. Property address: 4417 Schooner Drive, Anacortes, WA 98221. Parcel No: P131002. Petition No: 24-177. Assessor's Value: Land $290,400; Improvements $725,900; Total $1,016,300. BOE Value Determination: Land $290,400; Improvements $725,900; Total $1,016,300. The petitioner was not present at the January 23, 2025 hearing. Property described as residential home on ~0.15 acres located at 4417 Schooner Drive, Anacortes, Skagit County, WA. The Board unanimously upheld the Assessor. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-177.pdf_page1.png"
  },
  {
    "hearing_date": "February 6, 2025",
    "petition_number": "24-173",
    "decision": "Board unanimously upholds the Assessor's value (no reduction).",
    "value_reduction": 0,
    "notes": "Property: residential home located at 2314 42nd Place, Anacortes, WA 98221 (0.28 acres). Parcel no P114071. Petitioner's name: Michael McFarland. Petitioner was present at the February 6, 2025 hearing. Assessor's value: Land $267,500; Improvements $500,200; Total $767,700. BOE value determination: $767,700 (same as assessor). The petitioner purchased the home in June 2023 for $764,000 and did not submit market evidence to support a reduction. Burden of proof on petitioner. The Board unanimously upheld the Assessor. Dated February 14, 2025. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-173.pdf_page1.png"
  },
  {
    "hearing_date": "March 27, 2025",
    "petition_number": "24-314",
    "decision": "BOE Value Determination",
    "value_reduction": 39500,
    "notes": "Property: residential condo at 2521 River Vista Court, Unit B, Mount Vernon, WA 98273. Petitioner: Irene Prokuski. Petition No: 24-314; Parcel No: P134947. Assessor's Value: Land $179,100; Improvements $435,400; Total $614,500. BOE Determination: Land $179,100; Improvements $395,900; Total $575,000. The petitioner was present at the March 27, 2025, hearing. Property description: condo in a complex of 22 units; unit is 10 feet from neighbor with no views; neighbor has a significantly better view. One condo sold in 2024 that raised values; petitioner states property valued at almost $65,000 over the average. The Assessor, represented by Deputy Assessor Brian Herring and Doug Webb, noted market evidence supports a stipulated amount of $575,000. BOE members present: Rich Holtrop, Betta Spinelli, and John Rantschler. The Board unanimously overruled the original assessment and assigned a new value of $575,000 for the subject property.",
    "source_file": "24-314.pdf_page1.png"
  },
  {
    "hearing_date": "January 23, 2025",
    "petition_number": "24-068",
    "decision": "Board of Equalization upheld the Assessor's value; no value reduction.",
    "value_reduction": 0,
    "notes": "Parcel No: P128107. Petitioner not present at the January 23, 2025 hearing. Property: residential home on 0.12 acres located at 461 Schooner Drive, Anacortes, Skagit County, Washington. Description: approximately 1,300 sq ft, single story, no view; backs Highway 20 and a bus stop; in the San Juan Passage Neighborhood (one of 6 homes out of 99 lots). Assessor's Value: Land $265,000; Improvements $542,500; Total $807,500. BOE Value Determination mirrors the Assessor's values (no reduction). BOE members present: Rich Holtrop, Angie Bossarte, Betta Spinelli. The Board unanimously upheld the Assessor. Signs: Rich Holtrop (Chair); Crystal Carter (Clerk of the Board).",
    "source_file": "24-068.pdf_page1.png"
  },
  {
    "hearing_date": "2025-03-27",
    "petition_number": "24-323",
    "decision": "Board of Equalization upheld the Assessors value (no reduction). Total assessed value: $549,800 (Land $240,400; Improvements $309,400).",
    "value_reduction": 0,
    "notes": "Petitioner: Sarah Flemming (address on petition: 1210 Lakeview Blvd E. 102, Seattle, WA 98102). Property described as a residential home on ~0.1 acres located at 32779 South Shore Drive, Mount Vernon, Skagit County, Washington. The Assessor’s values: Land $240,400; Improvements $309,400; Total $549,800. The BOE’s determination matched the assessor’s value; the Board unanimously upheld the Assessor. The petitioner was present at the March 27, 2025 hearing. Additional context in the document notes appraised value of $500,000 in November 2021 and ongoing appraisal discussions. Signed by BOE Chair Rich Holtropp and Clerk Crystal Carter (dates on order: April 8, 2025).",
    "source_file": "24-323.pdf_page1.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "",
    "value_reduction": 0,
    "notes": "Mailed: Crystal Carter, Clerk of the Board. NOTICE: This order can be appealed to the State Board of Tax Appeals by filing a notice of appeal with them at P.O. Box 40915, Olympia, Washington 98504-0915, within thirty days of the date of mailing this order. The notice of appeal form is available from the Skagit County Assessor, the Skagit County Board of Equalization Office, or the State Board of Tax Appeals and online at: bta.state.wa.us",
    "source_file": "24-057.pdf_page2.png"
  },
  {
    "hearing_date": "February 20, 2025",
    "petition_number": "24-208",
    "decision": "Board unanimously upholds the Assessor's value; no reduction granted",
    "value_reduction": 0,
    "notes": "Owner: Kevin Guthrie. Property: 4533 Anaco Beach Road, Anacortes, Skagit County, Washington. Parcel No.: P61827. Assessed values per order: LAND $1,149,600; IMPROVEMENTS $758,400; TOTAL $1,908,000. The property is described as a residential home on 0.63 acres. The petitioner was not present at the February 20, 2025 hearing. BOE members present: Rich Holtrop (Chair), Angie Bossarte, Betta Spinelli. Order dated March 4, 2025. Clerk of the Board: Crystal Carter.",
    "source_file": "24-208.pdf_page1.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "",
    "value_reduction": 0,
    "notes": "The provided image appears to be a 404 Not Found page for Skagit County (Welcome to Skagit County) with a Global Menu and many links. It does not contain any hearing details (no owner name, property address, petition number, hearing date, or decision). Unable to extract relevant data from this image.",
    "source_file": "24-094.pdf_page1.png"
  },
  {
    "hearing_date": "February 6, 2025",
    "petition_number": "24-316",
    "decision": "Board unanimously upholds the Assessor",
    "value_reduction": 0,
    "notes": "Owner: Shepard Family Trust; Petitioner: William Shepard; Property: 3820 R Avenue, Anacortes, WA 98221 (Parcel No. P58816). Assessor's values: Land $300,200; Improvements $250,200; Total $550,400. BOE value determination: $550,400 (Land $300,200; Improvements $250,200; Total $550,400). The petitioner attended the February 6, 2025 hearing. The Board found the subject property bracketed within a range of $490,000 - $600,000 and upheld the assessor; the petitioner did not provide sufficient evidence to overcome the standard to overrule the assessor. Order dated February 14, 2025; Signatures: Rich Holtropp, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-316.pdf_page1.png"
  },
  {
    "hearing_date": "February 13, 2025",
    "petition_number": "24-114",
    "decision": "Board unanimously upholds the Assessor's valuation (no change to assessed values).",
    "value_reduction": 0,
    "notes": "Owner: Ownwell, Inc.  Property: residential home on 0.17 acres at 5603 Sugarloaf Street, Anacortes, Skagit County, Washington. Parcel No P59091; Petitioner: Alexander Wilhelm; Petition No 24-114. Assessor's values: Land $260,000; Improvements $470,600; Total $730,600. BOE value determination: $730,600 (no change). The burden of proof is on the petitioner; four comparable sales provided ranged from $554,000 to $658,000 with median $622,000; Petitioner’s representative was present at the February 13, 2025 hearing.",
    "source_file": "24-114.pdf_page1.png"
  },
  {
    "hearing_date": "null",
    "petition_number": "null",
    "decision": "null",
    "value_reduction": 0,
    "notes": "NOTICE: This order can be appealed to the State Board of Tax Appeals by filing a notice of appeal with them at P.O. Box 40915, Olympia, Washington 98504-0915, within thirty days of the date of mailing this order. The notice of appeal form is available from the Skagit County Assessor, the Skagit County Board of Equalization Office, or the State Board of Tax Appeals and online at: bta.state.wa.us",
    "source_file": "24-182.pdf_page2.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "",
    "value_reduction": 0,
    "notes": "The image page contains only a notice about appeal procedures and does not include any specific hearing data. No hearing_date, petition_number, owner_name, property_address, or decision is present on this page. If there are additional pages from the PDF, please provide them for extraction.",
    "source_file": "24-324.pdf_page2.png"
  },
  {
    "hearing_date": "April 1, 2025",
    "petition_number": "24-090",
    "decision": "Upheld the Assessor's valuation (no reduction)",
    "value_reduction": 0,
    "notes": "Parcel No: P34522. The order concerns assessment year 2024 for the property at 9694 Farm to Market Road, Bow, WA 98232. Petitioner: David & Cathy Grant. The property is described as a residential home on 8.8 acres. Assessor's values: Land $450,500; Improvements $354,200; Total $804,700. BOE value determination matches total $804,700. Petitioner appeared at the April 1, 2025 hearing; the Board found no market evidence submitted to support a reduction. The Board unanimously upheld the Assessor. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk. Notice of appeal to the State Board of Tax Appeals is available within the specified period.",
    "source_file": "24-090.pdf_page1.png"
  },
  {
    "hearing_date": "April 1, 2025",
    "petition_number": "24-299",
    "decision": "Board overruled the Assessor and assigned a new assessed value of $775,000.",
    "value_reduction": 48400,
    "notes": "Owner(s): Joel & Jenny Murray. Parcel No: P34989. Property address: 10731 Bayview Edison Road, Mount Vernon, WA 98273. Assessor's value: Land $476,000; Improvements $347,400; Total $823,400. BOE value determination: Land $476,000; Improvements $299,000; Total $775,000. The petitioner attended the April 1, 2025 hearing. Property described as a residential home on 5.62 acres located at the address. The owner notes roof damage requiring repairs (quote ~ $60,000) and related water damage; proximity to campgrounds with associated smoke concerns. The Board overruled the assessor and set a new total assessed value of $775,000.",
    "source_file": "24-299.pdf_page1.png"
  },
  {
    "hearing_date": "April 24, 2025",
    "petition_number": "24-085",
    "decision": "Board of Equalization upholds the Assessor's value (no change).",
    "value_reduction": 0,
    "notes": "The petitioner was not present at the April 24, 2025 hearing. Property described as residential on 3.54 acres located at 28601 South Skagit Highway, Sedro Woolley, Skagit County, Washington. Assessed values: Land $238,300; Improvements $94,400; Total $332,700. BOE value determination matches assessor's value; total $332,700. The Board unanimously upheld the Assessor. Dated April 30, 2025. Petitioner: Llane Rusnak; Parcel No: P40691. Signatures: Rich Holtrup (Chair); Crystal Carter (Clerk of the Board).",
    "source_file": "24-085.pdf_page1.png"
  },
  {
    "hearing_date": "April 8, 2025",
    "petition_number": "24-141",
    "decision": "Board of Equalization upheld the Assessor's value",
    "value_reduction": 0,
    "notes": "Parcel No: P27666. Assessed value: Land $471,200; Improvements $0; Total $471,200. BOE value determination: Land $471,200; Improvements $0; Total $471,200. The property is described as residential land on about 10.3 acres located at 14804 State Route 9, Mount Vernon, Skagit County, WA. Petitioner: Ann Adams (address listed as 2035 S 34th Street, Kansas City, KS 66101). The Board unanimously upheld the assessor’s value; no reduction awarded.",
    "source_file": "24-141.pdf_page1.png"
  },
  {
    "hearing_date": "2025-02-06",
    "petition_number": "24-046",
    "decision": "Board of Equalization upholds the Assessor; no reduction in value",
    "value_reduction": 0,
    "notes": "Owner: Greg Monaghan. Property: 2908 17th Street, Anacortes, WA 98221 (parcel No. P127445). The petitioner did not attend the February 6, 2025 hearing. The property is described as a residential home on approximately 0.32 acres. Assessed values shown: LAND $477,400; IMPROVEMENTS $980,700; TOTAL $1,458,100. The 2024 assessed value mentioned as $410,100 for Lot #25 (not currently developed) and comparables cited including a 2020 sale of $350,000; the Board sustained the current evaluation with no reduction. Board members present: Rich Holtropp, Angie Bossarte, Betta Spinelli. Signed by Rich Holtrop, Chair; Clerk Crystal Carter. Date of order: February 12, 2025 (noted on document).",
    "source_file": "24-046.pdf_page1.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "Upon motion duly made and seconded, the Board unanimously upholds the Assessor.",
    "value_reduction": 0,
    "notes": "Dated: (not shown). Mailed: Clerk of the Board. NOTICE: This order can be appealed to the State Board of Tax Appeals by filing a notice of appeal with them at P.O. Box 40915, Olympia, Washington 98504-0915, within thirty days of the date of mailing this order. The notice of appeal form is available from the Skagit County Assessor, the Skagit County Board of Equalization Office, or the State Board of Tax Appeals and online at: bta.state.wa.us",
    "source_file": "24-187.pdf_page2.png"
  },
  {
    "hearing_date": "2025-03-06",
    "petition_number": "24-349",
    "decision": "Board unanimously upholds the Assessor",
    "value_reduction": 0,
    "notes": "Owner: Carl & Rachel Lenander. Parcel No: P55556. Property: 1504 M Avenue, Anacortes, WA 98221. Hearing held March 6, 2025; Order dated March 14, 2025. Petitioner: Carl & Rachel Lenander; Petition No 24-349; Parcel No P55556. Property: residential home on 0.21 acres located at 1504 M Avenue, Anacortes, Skagit County, Washington. Assessor's Value: Land $345,300; Improvements $452,300; Total $797,600. BOE Value Determination: Land $345,300; Improvements $452,300; Total $797,600. The petitioner argued the valuation was too high; The Assessor provided market evidence supporting the current assessment; The Board sustained the current evaluation. The Board unanimously upholds the Assessor. Dated signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-349.pdf_page1.png"
  },
  {
    "hearing_date": "null",
    "petition_number": "null",
    "decision": "null",
    "value_reduction": 0,
    "notes": "NOTICE: This order can be appealed to the State Board of Tax Appeals by filing a notice of appeal with them at P.O. Box 40915, Olympia, Washington 98504-0915, within thirty days of the date of mailing this order. The notice of appeal form is available from the Skagit County Assessor, the Skagit County Board of Equalization Office, or the State Board of Tax Appeals and online at: bta.state.wa.us",
    "source_file": "24-317.pdf_page2.png"
  },
  {
    "hearing_date": "2025-04-17",
    "petition_number": "24-321",
    "decision": "BOE value determination upheld the Assessor's value; Petition withdrawn",
    "value_reduction": 0,
    "notes": "Hearing held via Zoom on 2025-04-17. Property described as a residential home on 24 acres located at 575 Poplar Place, Burlington, Skagit County, WA (Parcel No. P107043). Assessor's values: Land 217,800; Improvements 308,000; Total 525,800. BOE value determination: 217,800; 308,000; 525,800 (same as Assessor). The petitioner withdrew the petition during testimony. BOE members present: Rich Holtrup, Angie Bossarte, Betta Spinelli. Assessor's representatives: Deputy Assessor Brian Herring and Doug Webb. Order dated 2025-04-21.",
    "source_file": "24-321.pdf_page1.png"
  },
  {
    "hearing_date": "February 6, 2025",
    "petition_number": "24-328",
    "decision": "Overruled the Assessor's value and assigned a new total assessed value of $950,000 (Land $245,300; Improvements $704,700).",
    "value_reduction": 86600,
    "notes": "Petitioner was present at the February 6, 2025 hearing. The property is described as a residential home situated on .21 acres located at 3708 W 12th Street, Anacortes, Skagit County, Washington. Parcel No: P114062. Original Assessor's Value: Land $245,300; Improvements $794,300; Total $1,036,600. The BOE overrode to a total of $950,000 (reduction of $86,600). Board members present: Rich Holtrip (Chair), Angie Bossarte, Betta Spinelli. Dated order February 14, 2025; signatures by Rich Holtrip and Crystal Carter (Clerk).",
    "source_file": "24-328.pdf_page1.png"
  },
  {
    "hearing_date": "April 17, 2025",
    "petition_number": "24-022",
    "decision": "Board of Equalization unanimously upheld the Assessor's valuation (no reduction).",
    "value_reduction": 0,
    "notes": "Petitioner: Voree Smith; Address: 20475 Hamilton Court, Burlington, WA 98233; Parcel No: P102643. The order pertains to Assessment Year 2024 – Tax Year 2025. Hearing date noted as April 17, 2025; Order date: April 21, 2025. Subject property described as a residential home on ~0.3 acres located at 20475 Hamilton Court, Burlington, Skagit County, WA. Assessor's values: LAND $217,800; IMPROVEMENTS $305,300; TOTAL $523,100. The petitioner argued for a value reduction; Board did not grant a reduction after evaluating evidence. Signatures on the BOE order include Rich Holtrup, Chair, and Crystal Carter, Clerk of the Board.",
    "source_file": "24-022.pdf_page1.png"
  },
  {
    "hearing_date": "April 17, 2025",
    "petition_number": "24-089",
    "decision": "Unanimously uphold the Assessor's valuation",
    "value_reduction": 0,
    "notes": "Petitioner: David & Deborah Searing (Parcel No: P66666). Property address cited: 34536 South Shore Drive, Mount Vernon, WA 98274 (the address block shows 34535 South Shore Drive; body text states 34536). Assessor's value: Land $46,000; Improvements $0; Total $46,000. BOE value determination: Land $46,000; Improvements $0; Total $46,000. The Board of Equalization unanimously upheld the assessor's valuation. The burden of proof rests with the petitioner; the board found insufficient evidence to support a reduction. Order dated April 21, 2025; Signed by Rich Hol trop, Chair, and Crystal Carter, Clerk of the Board.",
    "source_file": "24-089.pdf_page1.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "Board unanimously upholds the Assessor",
    "value_reduction": 0,
    "notes": "Order: 'Upon motion duly made and seconded, the Board unanimously upholds the Assessor.' Dated: [not shown]. Signed by Rich Holtrop, Chair; Mailed: Crystal Carter, Clerk of the Board. NOTICE: This order can be appealed to the State Board of Tax Appeals by filing a notice of appeal with them at P.O. Box 40915, Olympia, Washington 98504-0915, within thirty days of the date of mailing this order. The notice of appeal form is available from the Skagit County Assessor, the Skagit County Board of Equalization Office, or the State Board of Tax Appeals and online at: bta.state.wa.us",
    "source_file": "24-164.pdf_page2.png"
  },
  {
    "hearing_date": "February 20, 2025",
    "petition_number": "24-109",
    "decision": "Board of Equalization unanimously upheld the Assessor's value (no change).",
    "value_reduction": 0,
    "notes": "Parcel No: P68260. The petitioner was not present at the February 20, 2025 hearing. Property: residential home on 1.3 acres located at 12392 Windward Way, Anacortes, Skagit County, WA. Owner name: Philippa White. Assessor's Value: Land $694,400; Improvements $1,264,700; Total $1,959,100. BOE Value Determination matches Assessor's Value: Land $694,400; Improvements $1,264,700; Total $1,959,100. CMA done 3/21/2024. No upgrades since construction 1999/2000. The Board heard from the Deputy Assessor; the Board unanimously upheld the Assessor. Dated March 3, 2025. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-109.pdf_page1.png"
  },
  {
    "hearing_date": "February 6, 2025",
    "petition_number": "24-246",
    "decision": "Board of Equalization upheld the Assessor's value; no reduction granted.",
    "value_reduction": 0,
    "notes": "Petitioner: Ryan Broussard; Petitioner address: 22396 Summerleaf Lane, Sedro Woolley, WA 98284. Property: residential home on ~0.28 acres located at 2314 42nd Place, Anacortes, Skagit County, Washington. Assessor's Value: Land $248,800; Improvements $147,400; Total $396,200. BOE Value Determination: Land $248,800; Improvements $147,400; Total $396,200. The petitioner was not present at the February 6, 2025 hearing. The burden of proof rests with the petitioner; the Board found no sufficient evidence to support a reduction and unanimously upheld the Assessor. Board members present: Rich Holtrop, Angie Bossarte, Betta Spinelli. Order dated February 18, 2025; signatures: Rich Holtrop (Chair) and Crystal Carter (Clerk).",
    "source_file": "24-246.pdf_page1.png"
  },
  {
    "hearing_date": "March 20, 2025",
    "petition_number": "24-313",
    "decision": "BOE value determination: $735,000",
    "value_reduction": 0,
    "notes": "Owner(s): Alexander & Stephanie Ludwig. Property: 4964 E Division Street, Mount Vernon, WA 98274 (Parcel No. P27566). Assessor's value: Land $217,800; Improvements $350,200; Total $568,000. BOE value determination: Land $384,800; Improvements $350,200; Total $735,000. The petitioner was not present at the March 20, 2025 hearing. Property described as a residential home on ~0.2 acres; located in Skagit County, WA. There is mention of a building permit from 2022 to fix the foundation; home appraised at $735,000. BOE members present: Rich Holtrop, Angie Bossarte, Betta Spinelli. The burden of proof lies with the petitioner; new value assigned: $735,000 for the subject property.",
    "source_file": "24-313.pdf_page1.png"
  },
  {
    "hearing_date": "April 1, 2025",
    "petition_number": "24-311",
    "decision": "The Board unanimously upholds the Assessor.",
    "value_reduction": 0,
    "notes": "Petitioner Andrew & Kelli Ryan were present at the April 1, 2025 hearing. Property described as a residential home on .42 acres located at 16983 Sargent Lane, Burlington, Skagit County, Washington. Assessed values: Land $334,300; Improvements $465,900; Total $800,200. BOE value determination matches assessor's values. Burden of proof is on the petitioner; no evidence was submitted to support a reduction. Order indicates the Board unanimously upheld the Assessor.",
    "source_file": "24-311.pdf_page1.png"
  },
  {
    "hearing_date": "2025-01-30",
    "petition_number": "24-147",
    "decision": "Board overruled the Assessor and assigned a new assessed value of $560,400",
    "value_reduction": 100000,
    "notes": "The petitioner was not present at the January 30, 2025 hearing. Property is described as a residential home on 0.38 acres located at 2910 K Avenue, Anacortes, Skagit County, WA (Parcel No: P31956). The appellant purchased the home on 8/29/2024 for $375,000 and described severe conditions requiring full renovation; requested a value reduction to reflect this. The Assessor's values were Land $300,500 and Improvements $359,900 for a total of $660,400. The Board’s determination set Land $300,500 and Improvements $259,900 for a total of $560,400. The Board overruled the assessor and assigned the new value of $560,400. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-147.pdf_page1.png"
  },
  {
    "hearing_date": "2025-01-30",
    "petition_number": "24-166",
    "decision": "Board upheld the Assessor's value (no reduction) for Tax Year 2025.",
    "value_reduction": 0,
    "notes": "Owner(s): Michael Mills and Rita Mills. Property: 4512 Clipper Drive, Anacortes, WA 98221 (parcel no. P131807). Assessor's Value: Land $421,900; Improvements $1,209,400; Total $1,631,300. BOE Value Determination matches Assessor's values (Total $1,631,300). Petitioner present at hearing. The hearing discusses adjustments and unadjusted values, but the Board found no reduction was warranted and unanimously upheld the Assessor.",
    "source_file": "24-166.pdf_page1.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "Upon motion duly made and seconded, the Board unanimously upholds the Assessor.",
    "value_reduction": 0,
    "notes": "Skagit County Board of Equalization. Dated: Rich Holtrop, Chair. Mailed: Crystal Carter, Clerk of the Board. NOTICE: This order can be appealed to the State Board of Tax Appeals by filing a notice of appeal with them at P.O. Box 40915, Olympia, Washington 98504-0915, within thirty days of the date of mailing this order. The notice of appeal form is available from the Skagit County Assessor, the Skagit County Board of Equalization Office, or the State Board of Tax Appeals and online at: bta.state.wa.us",
    "source_file": "24-188.pdf_page2.png"
  },
  {
    "hearing_date": "April 17, 2025",
    "petition_number": "24-202",
    "decision": "UPHELD ASSESSOR'S VALUE",
    "value_reduction": 0,
    "notes": "The petitioner withdrew the petition during testimony; the Skagit County Board of Equalization unanimously upheld the Assessor's value. Assessed values: Land $211,200; Improvements $192,600; Total $403,800. Petitioner: Mercy Galindo. Parcel No: P104141. Property: 1207 Kendra Lane, Burlington, Skagit County, Washington.",
    "source_file": "24-202.pdf_page1.png"
  },
  {
    "hearing_date": "February 27, 2025",
    "petition_number": "24-070",
    "decision": "Board overruled the assessor and assigned a new assessed value of $575,000",
    "value_reduction": 49200,
    "notes": "Petitioner: Douglas Winge; Parcel No: 117551; Property: condominium located at 1817 Cedar Springs Lane, Anacortes, WA 98221. Assessor's value: $624,200; BOE value: $575,000. The Board overruled the Assessor and set the new assessed value of $575,000 after reviewing comparable sales evidence and testimony. Dated: March 10, 2025. Board signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-070.pdf_page1.png"
  },
  {
    "hearing_date": "April 24, 2025",
    "petition_number": "24-038",
    "decision": "BOE upholds Assessor's value; no value reduction.",
    "value_reduction": 0,
    "notes": "Petitioner: Carolyn Dever; Parcel No: P116726; Property: 737 West Point Drive, Burlington, WA 98233. Assessor's values: Land $180,900; Improvements $227,200; Total $408,100. BOE value determination mirrors assessor (no reduction). The petitioner was not present at the April 24, 2025 hearing. The board members present were Rich Holtrop (Chair), Angi Bossarte, Betta Spinelli. The Board unanimously upheld the Assessor. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk. Dated order issued April 28, 2025.",
    "source_file": "24-038.pdf_page1.png"
  },
  {
    "hearing_date": "March 13, 2025",
    "petition_number": "24-002",
    "decision": "BOE unanimously upheld the Assessor's value (no change to assessed value).",
    "value_reduction": 0,
    "notes": "Owner: Sarah Zastoupil. Property address: 1205 N 16th Street, Mount Vernon, WA 98273. Parcel No: P25709. Assessor's Value: Land $238,800; Improvements $562,200; Total $801,000. BOE Value Determination: Land $238,800; Improvements $562,200; Total $801,000. The petitioner was not present at the March 13, 2025 hearing. The property is described as a residential home on .15 acres located at 1205 N 16th Street, Mount Vernon, WA. The Assessor was represented by Deputy Assessor Brian Herring and Doug Webb; they did not provide a response due to no evidence submitted by the petitioner. BOE members present: Rich Holtrop (Chair), Angie Bossarte, Betta Spinelli. The burden of proof is on the petitioner; the petitioner did not submit the appraisal or other evidence mentioned in the petition. Upon motion, the Board unanimously upheld the Assessor. Dated: March 24, 2025. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-002.pdf_page1.png"
  },
  {
    "hearing_date": "May 8, 2025",
    "petition_number": "24-180",
    "decision": "Board unanimously upheld the Assessor's valuation; no change to assessed value.",
    "value_reduction": 0,
    "notes": "Owner: Patrick Mulcahey. Property: 44116 Dalles Road, Concrete, WA 98237 (5.54 acres, residential). Parcel No: P101065. Assessed values: LAND $200,800; IMPROVEMENTS $756,100; TOTAL $956,900. The petitioner was present at the May 8, 2025 hearing. Order date: May 13, 2025. The appellant described the property and referenced purchase price and flood-plain concerns; the Board upheld the assessor's valuation.",
    "source_file": "24-180.pdf_page1.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "",
    "value_reduction": 0,
    "notes": "Appeal notice present. The page shows a signature line: Crystal Carter, Clerk of the Board. The only substantive text is a NOTICE explaining how to appeal this order: file a notice of appeal with the State Board of Tax Appeals within 30 days of the mailing date. The notice form is available from the Skagit County Assessor, the Skagit County Board of Equalization Office, or the State Board of Tax Appeals, and online at bta.state.wa.us. No hearing date, owner name, property address, or decision/value reduction is provided on this page.",
    "source_file": "24-120.pdf_page2.png"
  },
  {
    "hearing_date": "April 28, 2025",
    "petition_number": "24-250",
    "decision": "The Skagit County Board of Equalization unanimously upholds the Assessor.",
    "value_reduction": 0,
    "notes": "The petitioner was not present at the April 24, 2025 hearing. The property is described as a residential property situated on .68 acres located at 20200 Cook Road, Burlington, Skagit County, Washington. The Assessor’s value: Land $218,900; Improvements $690,900; Total $909,800. The BOE value determination mirrors these figures: $218,900 (land), $690,900 (improvements), Total $909,800. The petitioner did not submit sufficient evidence to support a reduction; burden of proof rests with the petitioner. The Assessor, represented by Deputy Assessor Brian Herring and Doug Webb, did not provide a response due to lack of evidence. BOE members present were Rich Holtrop (Chair), Angie Bossarte, and Betta Spinelli. Upon motion duly made and seconded, the Board unanimously upholds the Assessor.",
    "source_file": "24-250.pdf_page1.png"
  },
  {
    "hearing_date": "February 13, 2025",
    "petition_number": "24-116",
    "decision": "Board of Equalization unanimously upholds the Assessor (no reduction in assessed value).",
    "value_reduction": 0,
    "notes": "Owner: Ownwell, Inc.\\nProperty address: 3211 Oakes, Anacortes, Skagit County, Washington (residential home on ~0.18 acres).\\nParcel/ID: Parcel No P58480.\\nAssessor's value: Land 262,000; Improvements 457,600; Total 719,600. BOE value determination matched assessor's value (no reduction).\\nPetitioner: Heather Newman; Petition No 24-116; Hearing date referenced as February 13, 2025.\\nThe Board noted comparable sales range and that the burden of proof rests with the petitioner. The proceeding was part of the Skagit County Board of Equalization Order for Assessment Year 2024 – Tax Year 2025; the order date is February 24, 2025.",
    "source_file": "24-116.pdf_page1.png"
  },
  {
    "hearing_date": "February 20, 2025",
    "petition_number": "24-334",
    "decision": "Board of Equalization overruled the assessor and assigned a new total assessed value of $928,800 (land $186,500; improvements $742,300).",
    "value_reduction": 80000,
    "notes": "Petitioner Bryan Cox appeared at the February 20, 2025 hearing. Property: residential home on 3.29 acres located at 14779 Lexington Avenue, Anacortes, Skagit County, WA 98221. Appellant cited age (~20 years) and claimed value increase; neighborhood conditions noted (trees, etc.). The Board reviewed evidence and, after testimony, reduced the assessor's value from $1,008,800 to $928,800.",
    "source_file": "24-334.pdf_page1.png"
  },
  {
    "hearing_date": "2025-05-07",
    "petition_number": "24-032",
    "decision": "Upholds the Assessor's Value",
    "value_reduction": 0,
    "notes": "Petitioner: John Sines. Parcel No: P35501. Property address: 23875 Hoogdal Road, Sedro Woolley, WA 98284. Description: residential property on 2.6 acres. Assessor's Value (Land): $255,100; (Improvements): $432,000; (Total): $687,100. BOE Value Determination: same amounts. The petitioner was not present at the April 29, 2025 hearing. Board members present: Rich Holtrop, Angie Bossarte, Betta Spinelli. The burden of proof is on the petitioner to provide clear, cogent, and convincing evidence to support a reduction; petitioner did not submit evidence to support a reduction. Therefore, the Board unanimously upholds the Assessor. A packet for the Senior Assistance program has been sent to the appellant. Dated/Signature: Signed by Rich Holtrop, Chair; Mailed to Crystal Carter, Clerk of the Board.",
    "source_file": "24-032.pdf_page1.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "",
    "value_reduction": 0,
    "notes": "- Page appears to be a notice and contains no hearing details.\n- Text at top describes appeal process to the State Board of Tax Appeals and where to obtain forms (P.O. Box, contact info). No owner name, property address, petition number, or decision data is present.",
    "source_file": "24-026.pdf_page2.png"
  },
  {
    "hearing_date": "April 17, 2025",
    "petition_number": "24-320",
    "decision": "Board unanimously upholds the Assessor's value",
    "value_reduction": 0,
    "notes": "Owner: Mercy Galindo. Property: 1504 Avon Avenue, Burlington, Skagit County, Washington (residential home on 0.21 acres). Parcel No: P72633. Hearing conducted via Zoom on April 17, 2025. The petitioner withdrew the petition during testimony. Assessor's value: Land $217,800; Improvements $209,700; Total $427,500. BOE value determination: $427,500 (same as Assessor). Order date: April 21, 2025. Petitioner address on record: Mercy Galindo, 16220 North Scottsdale Road, Ste 650, Scottsdale, AZ 85254.",
    "source_file": "24-320.pdf_page1.png"
  },
  {
    "hearing_date": "April 24, 2025",
    "petition_number": "24-067",
    "decision": "Board overruled the assessor and assigned a new assessed value of $794,700.",
    "value_reduction": 62000,
    "notes": "Owner: Lisa Lewis. Property: 17228 Sam Bell Road, Bow, WA 98232. Parcel No: P106778. Assessor's Value: Land $309,900; Improvements $546,800; Total $856,700. BOE Value Determination: Land $247,900; Improvements $546,800; Total $794,700. The order notes the petitioner was present at the April 24, 2025, hearing; Board overruled the assessor and set the new value of $794,700. Order dated May 8, 2025. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-067.pdf_page1.png"
  },
  {
    "hearing_date": "2025-05-08",
    "petition_number": "24-358",
    "decision": "Board of Equalization overruled the Assessor and assigned a new assessed value of $550,000.",
    "value_reduction": 56100,
    "notes": "Petitioner: Robert Lawson IV; Parcel No: P19227. Property: residential on 3.56 acres located at 5701 Campbell Lake Road, Anacortes, WA 98221. Assessor's value: Land $335,800; Improvements $270,300; Total $606,100. BOE value determination: Land $307,800; Improvements $242,200; Total $550,000. The petitioner's May 8, 2025 hearing led to BOE overruling the assessor and setting the new total value at $550,000.",
    "source_file": "24-358.pdf_page1.png"
  },
  {
    "hearing_date": "May 7, 2025",
    "petition_number": "24-336",
    "decision": "Board of Equalization upheld the Assessor's valuation (no reduction)",
    "value_reduction": 0,
    "notes": "Parcel No: P119431. Petitioner: Noal Cook. The Assessor's value: Land $209,800; Improvements $695,000; Total $904,800. BOE determination: $904,800. Not present at the April 29, 2025 hearing. Property: residential on ~0.83 acres, 10462 Ridge Place, Sedro Woolley, WA 98284. Board members: Rich Holtrop (Chair), Angie Bossarte, Betta Spinelli. Dated: Rich Holtrop, Chair. Mailed: Crystal Carter, Clerk of the Board.",
    "source_file": "24-336.pdf_page1.png"
  },
  {
    "hearing_date": "2025-01-16",
    "petition_number": "24-236",
    "decision": "Board of Equalization upheld the Assessor's valuation; no reduction granted.",
    "value_reduction": 0,
    "notes": "Petitioners: Brian & Linda Srb. Parcel numbers involved: P58163, P31692, P100914. Property described as a residential home on approximately 0.42 acres located at 2620 Oakes Avenue, Anacortes, Skagit County, Washington; the property is treated as one economic unit including P58163, P31692, and P100914. For parcel P58163: Assessor's value and BOE determination total 1,062,900 (Land 711,900; Improvements 351,000). For P31692: total 6,300 (Land 6,300; Improvements 0). For P100914: total 1,100 (Land 1,100; Improvements 0). The petition was not present at the January 16, 2025 hearing. The property was described as a residential home on 0.42 acres; purchase context and surrounding factors are discussed in the body of the report, including that the three parcels are considered as one economic unit and that there are extenuating factors cited by the petitioner. The Assessor's market evidence supported the current assessment, and the Board sustained the current evaluation. The BOE members present were Rich Holtrup, Angie Bossarte, and Betta Spinelli. The burden of proof is with the petitioner.",
    "source_file": "24-236.pdf_page1.png"
  },
  {
    "hearing_date": "February 20, 2025",
    "petition_number": "24-194",
    "decision": "BOE upheld the Assessor's Value (no reduction).",
    "value_reduction": 0,
    "notes": "Parcel No: P68328. Assessor's Value: Land $602,600; Improvements $1,250,500; Total $1,853,100. BOE Value Determination matches Assessor's Value (no change). Petitioner present at the February 20, 2025 hearing. Property: residential home on ~0.97 acres located at 3251 Biz Point Road, Anacortes, Skagit County, WA. Board unanimously upheld the assessor's valuation. Dated February 24, 2025; signatures: Rich Holtrop (Chair) and Crystal Carter (Clerk).",
    "source_file": "24-194.pdf_page1.png"
  },
  {
    "hearing_date": "May 1, 2025",
    "petition_number": "24-193",
    "decision": "Board unanimously upholds the Assessor's valuation; no change to the assessed value.",
    "value_reduction": 0,
    "notes": "Owner: Donald & Elizabeth Kosa. Property: 4935 Prairie Lane, Sedro Woolley, WA 98284. BOE values: LAND $334,800; IMPROVEMENTS $617,500; TOTAL $952,300 (same as assessor). The petitioner did not attend the April 24, 2025 hearing. The assessor supplied market evidence; petitioner failed to provide sufficient evidence to justify a reduction per the evidentiary standard. Board unanimously upheld the Assessor. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-193.pdf_page1.png"
  },
  {
    "hearing_date": "April 8, 2025",
    "petition_number": "24-142",
    "decision": "The Board of Equalization upheld the Assessor's valuation. No reduction to the assessed value; the assessed value remains $457,500 (land $457,500; improvements $0).",
    "value_reduction": 0,
    "notes": "Petitioner Ann Adams attended the hearing. Property described as residential land on 10 acres located at 14804 State Route 9, Mount Vernon, Skagit County, Washington. Parcel No: P27670. Assessor’s value: Land $457,500; Improvements $0; Total $457,500. The petitioner cited an 18% increase but presented no sufficient market evidence to warrant a reduction. The Board unanimously upheld the Assessor. Signatures: Rich Holtrup, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-142.pdf_page1.png"
  },
  {
    "hearing_date": "March 13, 2025",
    "petition_number": "24-110",
    "decision": "Board unanimously upholds the Assessor's valuation; no reduction granted.",
    "value_reduction": 0,
    "notes": "The petitioner was not present at the March 13, 2025 hearing. Property described as a residential home on .21 acres located at 18423 Lincoln Street, Mount Vernon, Skagit County, Washington. Assessor's values: Land $181,700; Improvements $182,100; Total $363,800. BOE value determination matched assessor's values. The Assessor's Office was represented by Deputy Assessor Brian Herring and Doug Webb; no response due to lack of evidence provided by petitioner. Board members present were Rich Holtrop, Angie Bossarte, and Betta Spinelli. The petitioner cited questions about the appeal form and assessment process but did not appear for the hearing. The burden of proof is on the petitioner to provide clear, cogent, convincing evidence to support a reduction; the petitioner did not submit sufficient evidence. The Board found the petitioner failed to overcome the evidentiary standard necessary to overrule the assessor. Upon motion duly made and seconded, the Board unanimously upholds the Assessor.",
    "source_file": "24-110.pdf_page1.png"
  },
  {
    "hearing_date": "January 30, 2025",
    "petition_number": "24-097",
    "decision": "The Skagit County Board of Equalization unanimously upheld the Assessor's valuation (no reduction).",
    "value_reduction": 0,
    "notes": "Owner: Jeffery Bear. Property address: 1316 25th Street, Anacortes, WA. Parcel number: P31761. The hearing covered assessment year 2024 – tax year 2025. Assessor's Value: Land $275,000; Improvements $349,100; Total $624,100. BOE Value Determination matched these amounts (Land $275,000; Improvements $349,100; Total $624,100). Property described as residential on .25 acres located in Anacortes, Skagit County. The petition was presented by Jeffery Bear; The Board members present were Rich Holtrop (Chair), John Rantschler, and Betta Spinelli. The order indicates the petitioner attended the hearing and that the Board upheld the assessor's value. Signed: Rich Holtrop, Chair; Crystal Carter, Clerk.",
    "source_file": "24-097.pdf_page1.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "",
    "value_reduction": 0,
    "notes": "The provided image appears to be a site navigation page (lists of links such as Records Management, Help, Contact) rather than a Skagit County Board of Equalization hearing decision. No hearing data (hearing_date, petition_number, owner_name, property_address, or decision/value_reduction) is present.",
    "source_file": "24-094.pdf_page5.png"
  },
  {
    "hearing_date": "January 23, 2025",
    "petition_number": "24-330",
    "decision": "Board of Equalization upheld the Assessor's valuation; no reduction in value. Assessor's value: 494,900 (Land 275,000; Improvements 219,900).",
    "value_reduction": 0,
    "notes": "Owner: David Oliver; Parcel No: P56247. Petitioner not present at the hearing. Property: residential home on ~0.24 acres located at 2220 15th Street, Anacortes, Skagit County, Washington. Assessor's value: Land 275,000; Improvements 219,900; Total 494,900. BOE value determination matches Assessor's: 494,900 total. The Board unanimously upheld the Assessor. Petition No: 24-330; Parcel No: P56247.",
    "source_file": "24-330.pdf_page1.png"
  },
  {
    "hearing_date": "May 8, 2025",
    "petition_number": "24-004",
    "decision": "BOE upheld the Assessor's value; no reduction.",
    "value_reduction": 0,
    "notes": "Petitioner: Lee Tuffis; Parcel No: P50331. Property described as residential on 10.34 acres located at 5054 Park Ridge Place, Burlington, Skagit County, WA 98233. The order notes the petitioner was present at the May 8, 2025, hearing. Assessed values: LAND $270,500; IMPROVEMENTS $109,000; TOTAL $379,500. BOE value determination matches these amounts. The petitioner argued issues related to access via easement; The burden of proof was on the petitioner and the Board found insufficient evidence to support a reduction, ultimately upholding the current valuation. The order is dated May 12, 2025.",
    "source_file": "24-004.pdf_page1.png"
  },
  {
    "hearing_date": "May 7, 2025",
    "petition_number": "24-354",
    "decision": "Board of Equalization upheld the Assessor's valuation (no reduction).",
    "value_reduction": 0,
    "notes": "Petitioner: Kara Cook. Property: residential property on 0.17 acres located at 1221 South 3rd Street, Mount Vernon, Skagit County, Washington. Assessor's value: Land $272,000; Improvements $236,400; Total $508,400. Parcel No.: P54303. Petition No.: 24-354. The petitioner requested a reduction of approximately $25,000 to $30,000 but did not submit sufficient evidence to support a reduction; the Board unanimously upheld the assessor's valuation. Date of hearing: May 7, 2025.",
    "source_file": "24-354.pdf_page1.png"
  },
  {
    "hearing_date": "March 26, 2025",
    "petition_number": "24-237",
    "decision": "Board unanimously upholds the Assessor's value (no change).",
    "value_reduction": 0,
    "notes": "Owner: Emily & Nicolas Tarantino. Property: 1804 E Highland Avenue, Mount Vernon, WA 98273. Assessor's value: Land $192,400; Improvements $405,900; Total $598,300. Petitioner was not present at the March 13, 2025 hearing. Property described as a residential home on 0.18 acres. The assessor did not provide a response due to the petitioner not providing evidence. BOE members present: Rich Holtrop (Chair), Angie Bossarte, Betta Spinelli. The burden of proof rests on the petitioner; the Board found the petitioner failed to overcome the evidentiary standard to overrule the assessor.",
    "source_file": "24-237.pdf_page1.png"
  },
  {
    "hearing_date": "April 8, 2025",
    "petition_number": "24-317",
    "decision": "Board of Equalization upheld the assessor's valuation; no reduction in assessed value. Total assessed value remains $468,600 (Land $392,100; Improvements $76,500).",
    "value_reduction": 0,
    "notes": "Petitioner: Michelle Newman; Parcel No: P66837; Property address: 32779 South Shore Drive, Mount Vernon, Skagit County, Washington. Assessed values: LAND $392,100; IMPROVEMENTS $76,500; TOTAL $468,600. The petitioner was not present at the March 27, 2025 hearing. The BOE unanimously upheld the assessor (Rich Holtrop, Chair; Crystal Carter, Clerk of the Board). The description notes the property is residential on ~0.1 acres; Board found no sufficient evidence to reduce the assessment.",
    "source_file": "24-317.pdf_page1.png"
  },
  {
    "hearing_date": "January 30, 2025",
    "petition_number": "24-078",
    "decision": "Board of Equalization upholds the Assessor's value; no reduction (Total value: $858,200)",
    "value_reduction": 0,
    "notes": "Owner: Glenn Diller; Property: 1920 13th Street, Anacortes, WA 98221 (Skagit County). Assessed value: Land $275,000; Improvements $583,200; Total $858,200. BOE value determination: Land $275,000; Improvements $583,200; Total $858,200. The petitioner was not present at the January 30, 2025, hearing. Property described as a residential home on 0.17 acres located at 1920 13th Street. The appellant cites four comparable properties; two used in assessor's comparable properties. The burden of proof is on the petitioner to provide clear evidence to support a reduction; petitioner did not submit sufficient evidence. The Board unanimously upheld the Assessor. Signing officials: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board (signatures on document).",
    "source_file": "24-078.pdf_page1.png"
  },
  {
    "hearing_date": "February 24, 2025",
    "petition_number": "24-196",
    "decision": "Board upholds the Assessor's valuation (no change to assessed value).",
    "value_reduction": 0,
    "notes": "Parcel No: P20067. Property: residential home on 1.93 acres located at 6973 State Route 20, Anacortes, Skagit County, WA. Assessor's Value – Land: $234,600; Improvements: $528,800; Total: $763,400. BOE Value Determination – Land: $234,600; Improvements: $528,800; Total: $763,400. The petitioner was not present at the February 13, 2025 hearing. BOE members present: Rich Holtrup, Angie Bossarte, Betta Spinelli. The Board unanimously upheld the Assessor. Signatures: Rich Holtrup (Chair); Crystal Carter (Clerk of the Board).",
    "source_file": "24-196.pdf_page1.png"
  },
  {
    "hearing_date": "April 2, 2025",
    "petition_number": "24-300",
    "decision": "BOE upheld the Assessor's value (no change).",
    "value_reduction": 0,
    "notes": "The petitioner was not present at the March 20, 2025 hearing. Property is described as a residential home situated on 0.2 acres located at 19654 Melody Lane, Mount Vernon, Skagit County, Washington. The appellant states the property does not justify the tax increase and is not worth as much as it was appraised. The Assessor, represented by Deputy Assessor Brian Herring and Doug Webb, did not provide a response due to the petitioner not providing evidence. BOE members present were Rich Holtrip, Angie Bossarte, and Betta Spinelli. The burden of proof is on the petitioner to provide clear, cogent, and convincing evidence to support the appeal; no evidence was provided. Therefore, the Board unanimously upholds the Assessor. Signed by Rich Holtrip, Chair, and Crystal Carter, Clerk of the Board.",
    "source_file": "24-300.pdf_page1.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "",
    "value_reduction": 0,
    "notes": "Image appears to be a generic page with multiple [image] placeholders; no hearing details (date, petition number, owner name, property address, or decision/value reduction) are legible. Please provide a higher-resolution page or the actual hearing document to extract data.",
    "source_file": "24-094.pdf_page2.png"
  },
  {
    "hearing_date": "March 6, 2025",
    "petition_number": "24-064",
    "decision": "BOE upheld the Assessor's valuation; no reduction. Total value remains $954,500 (Land $545,000; Improvements $409,500).",
    "value_reduction": 0,
    "notes": "Petitioner was not present at the March 6, 2025 hearing. Property: residential home located at 1301 D Avenue, Anacortes, Skagit County, WA. Assessor's value: Land $545,000; Improvements $409,500; Total $954,500. BOE value determination matches the assessor's values. The Board unanimously upheld the Assessor. Dated March 14, 2025. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-064.pdf_page1.png"
  },
  {
    "hearing_date": "March 3, 2025",
    "petition_number": "24-164",
    "decision": "BOE value determination: No change to assessor's value. Land $552,600; Improvements $3,828,700; Total $4,381,300.",
    "value_reduction": 0,
    "notes": "Residential home on 8.91 acres. Property located at 6010 Campbell Lake Road, Anacortes, Skagit County, Washington. Assessor’s value and BOE determination: Total $4,381,300 (Land $552,600; Improvements $3,828,700). Petitioner Kevin Geraghty did not submit sufficient evidence to warrant a reduction; Board sustained the assessor’s value. Board members present: Rich Holtrop, Angie Bossarte, Betta Spinelli.",
    "source_file": "24-164.pdf_page1.png"
  },
  {
    "hearing_date": "February 6, 2025",
    "petition_number": "24-058",
    "decision": "Board unanimously upholds the Assessor",
    "value_reduction": 0,
    "notes": "Petitioner was not present at the February 6, 2025 hearing. Property: residential home on 0.19 acres located at 3601 W 3rd Street, Anacortes, Skagit County, WA; Parcel No P58197; Petition No 24-058. Assessor's value: Land $477,400; Improvements $980,700; Total $1,458,100. BOE value determination matches assessor: $477,400 land, $980,700 improvements, total $1,458,100. The Board unanimously upheld the assessor; the petitioner failed to provide sufficient evidence to support a reduction. The petitioner argued about factors such as an electric field and added roadway, but no evidence to overcome the evidentiary standard.",
    "source_file": "24-058.pdf_page1.png"
  },
  {
    "hearing_date": "February 27, 2025",
    "petition_number": "24-189",
    "decision": "Board of Equalization assigned a new assessed value of $1,250,000 (BOE value determination).",
    "value_reduction": 111400,
    "notes": "Petitioner Robert Rohrich attended the February 27, 2025 hearing. The Assessor's Value totaled $1,361,400 ($931,100 Land; $430,300 Improvements). The BOE reduced the value to $1,250,000 (Land $931,100; Improvements $318,900). The property is described as a residential home on 0.14 acres located at 13219 Satterlee Road, Anacortes, Skagit County, Washington. The order was issued March 12, 2025 (signature by Rich Holtrop, Chair).",
    "source_file": "24-189.pdf_page1.png"
  },
  {
    "hearing_date": "March 18, 2025",
    "petition_number": "24-124",
    "decision": "Overruled the original assessment and assigned the new value of $1,600,000.",
    "value_reduction": 169100,
    "notes": "Owner: Edward Castleberry. Property: 20566 Benson Ridge Lane, Mount Vernon, WA 98274 (1 acre residential). Parcel No: P130335. Assessor's value: Land $284,800; Improvements $1,484,300; Total $1,769,100. BOE value: Land $284,800; Improvements $1,315,200; Total $1,600,000. Assessor proposed $1,650,000 based on comparables; petitioner testified to issues with hill/topography, easement, steep driveway, and repair costs (estimates up to $120,000; oral estimate of $1,400,000). The petitioner was present at the March 6, 2025 hearing. Board overruled original assessment and set value at $1,600,000.",
    "source_file": "24-124.pdf_page1.png"
  },
  {
    "hearing_date": "March 12, 2025",
    "petition_number": "24-029",
    "decision": "Board of Equalization upholds the Assessor's value.",
    "value_reduction": 100,
    "notes": "Petitioner: David Lynch; Parcel No: P133188. Property: residential home on 1 acre located at 2567 Boulder Reef Lane, Anacortes, Skagit County, WA. Assessor's value vs BOE determination: Land 395,100 / 395,000; Improvements 537,300; Total 932,400. The Board unanimously upheld the Assessor's value; Land value reduced by $100 relative to Assessor's value. The petitioner was not present at the February 27, 2025 hearing. BOE members present: Rich Holtrup (Chair), Betta Spinelli, John Rantschler.",
    "source_file": "24-029.pdf_page1.png"
  },
  {
    "hearing_date": "May 9, 2025",
    "petition_number": "24-308",
    "decision": "Board of Equalization upholds the Assessor's value (no reduction).",
    "value_reduction": 0,
    "notes": "Petitioner not present at the April 29, 2025 hearing. Property described as residential on 0.12 acres located at 1537 E Gateway Heights Loop, Sedro Woolley, Skagit County, Washington. Assessor's value: Land $156,300; Improvements $349,900; Total $506,200. BOE members present were Rich Holtrup (Chair), Angie Bossarte, and Betta Spinelli. The petitioner did not submit sufficient evidence to support a reduction; the Board unanimously upheld the Assessor's value.",
    "source_file": "24-308.pdf_page1.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "",
    "value_reduction": 0,
    "notes": "Page appears to be a closing/cover page of a Skagit County Board of Equalization order. Dated field is present but no date is shown; the signatures are Rich Holtrop, Chair, and Crystal Carter, Clerk of the Board. There is no information on this page for: owner_name, property_address, petition_number, hearing_date, decision, or value_reduction. The page contains the required NOTICE about appealing the order to the State Board of Tax Appeals, including the mailing address (P.O. Box 40915, Olympia, WA 98504-0915) and that an appeal must be filed within thirty days of the date of mailing. It also states where to obtain the notice of appeal form (Skagit County Assessor, Skagit County Board of Equalization Office, or online at bta.state.wa.us).",
    "source_file": "24-236.pdf_page2.png"
  },
  {
    "hearing_date": "May 8, 2025",
    "petition_number": "24-296",
    "decision": "Board unanimously upholds the assessor's valuation",
    "value_reduction": 0,
    "notes": "Owner(s): Ales & Jana Klabacka. Property: residential on 0.43 acres located at 42093 Cedar Street, Concrete, WA 98237 (Skagit County). Parcel No: P63382. Petition No: 24-296. Assessor's Value: Land $125,800; Improvements $320,500; Total $446,300. BOE Value Determination: Land $125,800; Improvements $320,500; Total $446,300. The petitioner was not present at the May 8, 2025 hearing. The Board of Equalization upheld the current valuation, noting the assessor’s market evidence supported the current assessment.",
    "source_file": "24-296.pdf_page1.png"
  },
  {
    "hearing_date": "March 6, 2025",
    "petition_number": "24-154",
    "decision": "BOE upholds the Assessor's valuation (no reduction granted).",
    "value_reduction": 0,
    "notes": "Owner: Steven Johnson. Parcel No: P16385. Property described as a residential home on 3.86 acres located at 19294 Holmstrom Road, Mount Vernon, Skagit County, WA. Address on the petitioner's line shows 19594 Holmstrom Road, Mount Vernon, WA 98274 (discrepancy in the record). Assessed value and BOE determination: Land $271,900; Improvements $249,400; Total $521,300 (same on both sides). Hearing occurred March 6, 2025; order issued March 17, 2025. The petitioner did not submit sufficient evidence to support a reduction; Board unanimously upheld the Assessor.",
    "source_file": "24-154.pdf_page1.png"
  },
  {
    "hearing_date": "2025-03-06",
    "petition_number": "24-151",
    "decision": "Board of Equalization upheld the assessor's value; no change to the parcel value.",
    "value_reduction": 0,
    "notes": "Petitioner: Taunya Sell. Parcel No: P66088. Property: 7764 Cypress Way, Anacortes, WA 98221. Assessor's value: Land $146,900; Improvements $1,900; Total $148,800. BOE value determination: same amounts ($146,900 / $1,900 / $148,800). The petitioner was present at the March 6, 2025 hearing. Burden of proof is on petitioner; no value change requested. Board members present: Rich Holtorp, Angie Bossarte, Betta Spinelli. Order dated March 17, 2025.",
    "source_file": "24-151.pdf_page1.png"
  },
  {
    "hearing_date": "February 13, 2025",
    "petition_number": "24-112",
    "decision": "Board unanimously upholds the Assessor",
    "value_reduction": 0,
    "notes": "Skagit County Board of Equalization order for Assessment Year 2024 – Tax Year 2025. Petitioner: Gary Swofford; Parcel No: P66872. Property described as a residential home on 0.27 acres located at 33074 Deer Park Lane, Mount Vernon, Skagit County, WA. Owner: Ownwell, Inc. Assessor's value: Land 416,400; Improvements 667,600; Total 1,084,000. BOE value determination matches assessor. Reduction requested: $915,000 (range indicated: $815,000 to $1,000,000). The burden of proof on petitioner. The Board unanimously upholds the Assessor. Notice of appeal to the State Board of Tax Appeals available within 30 days.",
    "source_file": "24-112.pdf_page1.png"
  },
  {
    "hearing_date": "February 6, 2025",
    "petition_number": "24-023",
    "decision": "Board unanimously upholds the Assessor's value; no reduction",
    "value_reduction": 0,
    "notes": "Parcel No. P120988. Owner: Faith & Tyler McKeen. Property: 3515 Marion Way, Anacortes, WA 98221. Assessed Values: Land $240,000; Improvements $808,900; Total $1,048,900. BOE Value Determination: same as Assessor's Value. The petitioner was not present at the February 6, 2025 hearing. The Board upheld the current assessment. Board members present: Rich Holtrop (Chair), Angie Bossarte, Betta Spinelli. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board. Order dated February 14, 2025.",
    "source_file": "24-023.pdf_page1.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "",
    "value_reduction": 0,
    "notes": "The image is an error/not-found page. It does not contain any Skagit County Board of Equalization hearing data (no owner name, address, petition number, hearing date, or decision). Please provide the actual hearing document (PDF/image) to extract structured data.",
    "source_file": "24-094.pdf_page3.png"
  },
  {
    "hearing_date": "2025-02-13",
    "petition_number": "24-117",
    "decision": "Approved the stipulated assessed value of $610,000.",
    "value_reduction": 79900,
    "notes": "Property: residential on 2.38 acres located at 614 John Liner Road, Sedro-Woolley, Skagit County, Washington. Assessor's value: Land $227,300; Improvements $462,600; Total $689,900. BOE value determination: Land $227,300; Improvements $382,700; Total $610,000. The petitioner's representative was present at the February 13, 2025 hearing. Appellant: Ownwell, Inc. Petitioner: Nehal Raval; Petition No: 24-117; Parcel No: P36511; Petitioner address: 401 Tom Landry Hwy, Dallas, TX 75266. The board motioned and seconded to approve the stipulated assessed value of $610,000. Board members present: Rich Holtrop, Angie Bossarte, Betta Spinelli. Order dated February 24, 2025.",
    "source_file": "24-117.pdf_page1.png"
  },
  {
    "hearing_date": "May 8, 2025",
    "petition_number": "24-242",
    "decision": "Board overruled the Assessor and assigned a new assessed value of $342,300",
    "value_reduction": 17500,
    "notes": "Petitioner: Robin Fairman; Petition No: 24-242; Parcel No: P63678. Property: residential on ~0.2 acres located at 64276 East Cascade Drive, Marblemount, Skagit County, WA. Assessor's value: Land $76,700; Improvements $283,100; Total $359,800. BOE value: Land $76,700; Improvements $265,600; Total $342,300. Petitioner was present at the May 8, 2025 hearing. BOE members present: Rich Holtrop (Chair), Angie Bossarte, Betta Spinelli. Board overruled the Assessor and assigned new assessed value of $342,300. Dated May 15, 2025. Signed by Rich Holtrop, Chair; Clerk of the Board Crystal Carter.",
    "source_file": "24-242.pdf_page1.png"
  },
  {
    "hearing_date": "April 1, 2025",
    "petition_number": "24-306",
    "decision": "Board upholds the assessor's value; no value reduction granted.",
    "value_reduction": 0,
    "notes": "Petitioner: Jeannie Englund. Parcel No: P64460. Property: 17298 Lake View Blvd, Mount Vernon, WA 98274. Assessor's values: Land $610,500; Improvements $1,109,300; Total $1,719,800. Petitioner requested reduction to $1,380,000. Hearing date referenced: April 1, 2025. Board decision dated April 9, 2025; Board unanimously upheld the assessor's valuation.",
    "source_file": "24-306.pdf_page1.png"
  },
  {
    "hearing_date": "March 24, 2025",
    "petition_number": "24-051",
    "decision": "Board of Equalization upheld the Assessor's valuation (no reduction).",
    "value_reduction": 0,
    "notes": "Owner: Timothy & Janel Nelson. Property: 10 Eagles Nest, La Conner, WA 98257. Parcel No: P15204. Assessor's Value: Land $551,700; Improvements $384,500; Total $936,200. BOE Value Determination: Land $551,700; Improvements $384,500; Total $936,200. Petitioner was present at the March 13, 2025 hearing. Description: residential home on 2.58 acres located at 10 Eagles Nest, La Conner, Skagit County. Board unanimously upheld the Assessor. Dated March 24, 2025. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-051.pdf_page1.png"
  },
  {
    "hearing_date": "April 29, 2025",
    "petition_number": "24-035",
    "decision": "BOE upholds the Assessor's value",
    "value_reduction": 0,
    "notes": "Owner: John & Judith Lee. Property: 820 Cook Road, Sedro Woolley, WA 98284 (0.25 acres). Assessor's value — Land: $163,200; Improvements: $195,900; Total: $359,100. BOE value determination matches assessor values. The petitioner was not present at the hearing. BOE members present: Rich Holtrop (Chair), Angie Bossarte, Betta Spinelli. The burden of proof lies with the petitioner; no documentary market evidence was provided. Upon motion duly made and seconded, the Board unanimously upheld the Assessor. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board. Order dated May 7, 2025.",
    "source_file": "24-035.pdf_page1.png"
  },
  {
    "hearing_date": "January 16, 2025",
    "petition_number": "24-077",
    "decision": "BOE upheld the assessor's value; no reduction to assessed value.",
    "value_reduction": 0,
    "notes": "Owner: David & Christine Hansen. Property: 2620 Oaks Avenue, Anacortes, WA 98221 (0.42 acres). Parcel No: P56025. Assessor's Value: Land $742,000; Improvements $590,600; Total $1,332,600. BOE Value Determination mirrors these amounts. The petitioner was not present at the hearing. The Board found the petitioner did not submit sufficient evidence to overcome the assessor's standard. The Board unanimously upheld the Assessor and advised a conference between the assessor and the appellant.",
    "source_file": "24-077.pdf_page1.png"
  },
  {
    "hearing_date": "May 12, 2025",
    "petition_number": "24-357",
    "decision": "Board of Equalization overruled the Assessor; new assessed value: total $619,900 (Land $156,300; Improvements $463,600).",
    "value_reduction": 3600,
    "notes": "Petitioner was not present at the April 29, 2025 hearing. Property: residential on 0.11 acres at 738 Parkland Loop, Sedro Woolley, Skagit County, WA. The BOE assigned a new total value of $619,900 by a two-to-one vote. Appeal information provided at bottom of document.",
    "source_file": "24-357.pdf_page1.png"
  },
  {
    "hearing_date": "February 6, 2025",
    "petition_number": "24-011",
    "decision": "BOE upheld the assessor's value; no change in value (Total 1,722,500; Land 477,400; Improvements 1,245,100).",
    "value_reduction": 0,
    "notes": "Owner(s): Greg & Jamie Allott. Property: 2814 17th Street, Anacortes, WA 98221 (Parcel No. P127442). Description: residential home on ~0.31 acres. 2022 building cost 1,051,000; lot purchase 350,000 (lot in October 2020). 2022 valuation 1,366,900; 2023 valuation ~1,777,800; current assessed value 1,722,500. Petitioner not present at the February 6, 2025 hearing. Assessor evidence supported current year; Board unanimously upheld the Assessor. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-011.pdf_page1.png"
  },
  {
    "hearing_date": "2025-01-16",
    "petition_number": "24-093",
    "decision": "Board upholds the Assessor's valuation; no value reduction.",
    "value_reduction": 0,
    "notes": "Owner: Michael Haith. Property: 4811 Schooner Drive, Anacortes, WA 98221. Parcel No: P131410. Assessor's Value: Land $303,900; Improvements $677,500; Total $981,400. BOE Value Determination: $303,900 (land) / $677,500 (improvements) / $981,400 (total). The petitioner did not submit sufficient evidence to support a reduction; Board unanimously upheld the Assessor. Hearing date: January 16, 2025. Signatures: Rich Holtrup, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-093.pdf_page1.png"
  },
  {
    "hearing_date": "April 1, 2025",
    "petition_number": "24-048",
    "decision": "Board upheld the Assessor's valuation; no reduction (BOE value equals Assessor's value).",
    "value_reduction": 0,
    "notes": "Parcel No: P123869. Property: 14320 Elsie Lane, Burlington, WA 98233. Assessor's value - Land $331,400; Improvements $763,600; Total $1,013,400. The petitioner, Dirk & Olga Vanderkooy, was not present at the April 1, 2025 hearing. The property is described as a residential home on 0.95 acres located at the address above. The appellant contended that an accessory dwelling was being added and that its value had already been included in the improvement value; the Board found insufficient evidence to support a reduction. The Board unanimously upheld the Assessor. Signed by Rich Holtrop, Chair, and Crystal Carter, Clerk of the Board.",
    "source_file": "24-148.pdf_page1.png"
  },
  {
    "hearing_date": "February 27, 2025",
    "petition_number": "24-185",
    "decision": "The Skagit County Board of Equalization unanimously upholds the Assessor.",
    "value_reduction": 104600,
    "notes": "Property: Parcel P65688; Address: 6968 Channel View Drive, Anacortes, Skagit County, Washington. Assessor's value: Land 510,100; Improvements 458,300; Total 968,400. Petitioner (Don Fraley on Rosebud Island Properties, LLC) requested reduction to 863,800 (to align with adjacent parcel P65689 valued at 405,550 for land). The petitioner was not present at the February 27, 2025 hearing. The Board found the petitioner failed to provide sufficient evidence to support a reduction and upheld the Assessor. Order dated March 12, 2025. Parcel details, adjacent properties, and signatures noted in the order.",
    "source_file": "24-185.pdf_page1.png"
  },
  {
    "hearing_date": "May 8, 2025",
    "petition_number": "24-312",
    "decision": "Board unanimously upholds the Assessor's valuation (no further reduction).",
    "value_reduction": 0,
    "notes": "Property: residential on 6.27 acres located at 19689 Parson Creek Road, Sedro Woolley, Skagit County, Washington. Parcel No: P49685; Petition No: 24-312. Owner(s): Craig & Tiffany Caulk. Address: 19689 Parson Creek Road, Sedro Woolley, WA 98284. Assessed value (Assessor's Value) – Land: $246,700; Improvements: $702,400; Total: $949,100. BOE Value Determination shows identical amounts. There is an existing adjustment reducing the assessed value by $77,800 from the 2022 appeal (the Assessor requested sustaining current valuation). The petitioner was not present at the May 8, 2025 hearing. Board members present: Rich Holtrip, Angie Bossarte, Betta Spinelli. The burden of proof remained with the petitioner; Board found no sufficient evidence to grant further reduction. Upon motion duly made and seconded, the Board unanimously upheld the Assessor. Signatures: Rich Holtrip, Chair; Clerk of the Board Crystal Carter (mailed).",
    "source_file": "24-312.pdf_page1.png"
  },
  {
    "hearing_date": "April 1, 2025",
    "petition_number": "24-184",
    "decision": "Overruled the Assessor's value and assigned a new value of $3,164,300 for the subject property.",
    "value_reduction": 150000,
    "notes": "Petitioner: Dale & Mary Galvin (Petition No. 24-184; Parcel No. P29894). Property: 17958 Cove Lane, Mount Vernon, Skagit County, Washington; described as residential home on 1.38 acres; built 1983. Assessor's value: Land $631,200; Improvements $2,683,100; Total $3,314,300. BOE value determination: Land $631,200; Improvements $2,533,100; Total $3,164,300. Hearing date referenced: April 1, 2025 (order dated April 9, 2025). The petitioner presented evidence (e.g., roof replacement costs; condition of docks; comparable sales) and the Board unanimously overruled the Assessor. Final value: $3,164,300. Signatures: Rich Holtrop, Betta Spinelli, John Rantschler; Clerk Crystal Carter. The order notes appeal rights to the State Board of Tax Appeals.",
    "source_file": "24-184.pdf_page1.png"
  },
  {
    "hearing_date": "2025-05-08",
    "petition_number": "24-055",
    "decision": "Unanimous upholding of the Assessor's valuation; no change to assessed value",
    "value_reduction": 25,
    "notes": "Petitioner Michael Splain & Douglas Stanek attended the May 8, 2025 hearing. Property described as residential on 2 acres located at 40179 Cape Horn Road, Concrete, Skagit County, Washington. The appellant cites a 1974 mobile home without foundation, with original aluminum wiring and single-pane windows. Issues include aging structure; front deck rotten; building sits on cinder blocks; assessment includes a downward adjustment of 25% to recognize inferior conditions of a pre-HUD manufactured home. The petitioner did not provide documentation supporting further adjustments. The Assessor noted the downward adjustment; Board sustained the current valuation. BOE members present: Rich Holtrop, Angie Bossarte, Betta Spinelli. Order signed by Rich Holtrop, Chair, and Crystal Carter, Clerk of the Board. Notice indicates appeal options. Order dated May 13, 2025.",
    "source_file": "24-055.pdf_page1.png"
  },
  {
    "hearing_date": "January 16, 2025",
    "petition_number": "24-071",
    "decision": "Board unanimously upheld the Assessor's value; no value reduction.",
    "value_reduction": 0,
    "notes": "Property: residential home on 0.14 acres at 1602 12th Street, Anacortes, Skagit County, Washington. Petitioner present at January 16, 2025 hearing. Petitioner Carolyn Suryan; Petition No 24-071; Parcel No P58003. Assessor's value: Land $289,100; Improvements $448,700; Total $737,800. BOE value determination matches assessor. Board findings: petitioner did not submit sufficient evidence to support a reduction; negative traffic influence on 12th Street noted. The Board unanimously upheld the Assessor. BOE members present: Rich Holtrop (Chair), Angie Bossarte, Betta Spinelli. Clerk: Crystal Carter.",
    "source_file": "24-071.pdf_page1.png"
  },
  {
    "hearing_date": "March 4, 2025",
    "petition_number": "24-305",
    "decision": "Skagit County Board of Equalization unanimously upheld the Assessor's value (no change to assessed value).",
    "value_reduction": 0,
    "notes": "Petitioner: Brittany Van Duine. Parcel No: P73642. Property: 14609 Dungeness Lane, Anacortes, WA 98221. Assessor's Value - Land: $641,500; Improvements: $242,400; Total: $883,900. BOE Value Determination: $883,900. The petitioner was not present at the February 20, 2025 hearing. Property described as residential home on 0.23 acres at the stated address in Skagit County, WA.",
    "source_file": "24-305.pdf_page1.png"
  },
  {
    "hearing_date": "March 13, 2025",
    "petition_number": "24-201",
    "decision": "New BOE assessed value: $509,200 (overruled the Assessor's total value of $536,000)",
    "value_reduction": 26800,
    "notes": "Petitioner: Michele Shiner. Property: residential home on 0.12 acres at 1609 N 19th Street, Mount Vernon, WA 98273. Parcel No: P52594. Assessor's total value: $536,000; BOE value determination: $509,200. Hearing date referenced in order: March 13, 2025; Order dated March 25, 2025. Board members present: Rich Holtrup (Chair), Angie Bossarte, Betta Spinelli. The burden of proof on petitioner; order can be appealed to the State Board of Tax Appeals.",
    "source_file": "24-201.pdf_page1.png"
  },
  {
    "hearing_date": "March 6, 2025",
    "petition_number": "24-129",
    "decision": "Board upheld the assessor's value; no reduction granted (Total assessed value unchanged at $1,194,300: Land $314,600; Improvements $879,700).",
    "value_reduction": 0,
    "notes": "Petitioner: Bradley & Cheryl Lenz. Parcel No: P17392. Property: 22495 Bulson Road, Mount Vernon, WA 98274 (5 acres, residential home). The assessor's value listed: Land $314,600; Improvements $879,700; Total $1,194,300. BOE value determination matched assessor values: Land $314,600; Improvements $879,700; Total $1,194,300. The petitioner argued market evidence and appraisal history (house purchased Dec 2022 for $979,000; 2023 appraisal; assessor’s value reduced to $1.1 million; other sales noted: six properties sold for ~$1.39M in 2023; one home sold Aug 2024 for $1.2M). The Board found insufficient evidence to reduce the assessment; burden of proof on petitioner; evidence presented by the assessor noted 2022 appraisal of $1.15M. Decision rendered by Skagit County Board of Equalization, with Rich Holtrop, Chair (signature on file); Clerk Crystal Carter also listed. The petitioner was present at the March 6, 2025 hearing.",
    "source_file": "24-129.pdf_page1.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "",
    "value_reduction": 0,
    "notes": "NOTICE: This order can be appealed to the State Board of Tax Appeals by filing a notice of appeal with them at P.O. Box 40915, Olympia, Washington 98504-0915, within thirty days of the date of mailing this order. The notice of appeal form is available from the Skagit County Assessor, the Skagit County Board of Equalization Office, or the State Board of Tax Appeals and online at: bta.state.wa.us",
    "source_file": "24-040.pdf_page2.png"
  },
  {
    "hearing_date": "March 12, 2025",
    "petition_number": "24-183",
    "decision": "Board unanimously upheld the Assessor's value",
    "value_reduction": 0,
    "notes": "Petitioner: Keith Omey; Parcel No: P67178. The petitioner was not present at the February 27, 2025 hearing. Property is described as a residential home on .91 acres located at 2330 Leadbetter Place, Anacortes, Skagit County, WA. Assessor's value: LAND $317,100; IMPROVEMENTS $158,600; TOTAL $475,700. BOE value determination matches assessor's values: LAND $317,100; IMPROVEMENTS $158,600; TOTAL $475,700. The Assessor did not provide a response or oral testimony due to lack of market evidence. The petitioner claimed improvements (approx. $20,000 into cabin since purchase: new roof, siding, paint) and described a well, limited water, solar electricity, and rotten floor repairs, but did not submit sufficient evidence of structural damage or market data to support a value reduction. The Board found the petitioner failed to overcome the evidentiary standard and upheld the assessor.",
    "source_file": "24-183.pdf_page1.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "",
    "value_reduction": 0,
    "notes": "Skagit County Board of Equalization hearing page appears to be the signature/notice page only. The visible items include: 'Mailed:' field with signature line for Crystal Carter, Clerk of the Board. The only substantive text is a NOTICE about appeal: This order can be appealed to the State Board of Tax Appeals by filing a notice of appeal with them at P.O. Box 40915, Olympia, Washington 98504-0915, within thirty days of the date of mailing this order. The notice of appeal form is available from the Skagit County Assessor, the Skagit County Board of Equalization Office, or the State Board of Tax Appeals and online at: bta.state.wa.us.",
    "source_file": "24-337.pdf_page2.png"
  },
  {
    "hearing_date": "April 30, 2025",
    "petition_number": "24-186",
    "decision": "Board upheld the Assessor's value; no value reduction",
    "value_reduction": 0,
    "notes": "Petitioner: Damien Fabre & Amber Robinson (Petition No: 24-186; Parcel No: P50173). Property: 28601 South Skagit Highway, Sedro-Woolley, Skagit County, WA (residential on ~1.25 acres). Petitioners' address: 20996 Prairie Road, Sedro Woolley, WA 98284. Assessor's value: Land $216,700; Improvements $580,200; Total $796,900. BOE determination matches: $216,700 land; $580,200 improvements; $796,900 total. The petitioner was not present at the hearing (per document; date referenced as April 24, 2025). Board members present were Rich Holtrop (Chair), Angie Bossarte, and Betta Spinelli. The Board unanimously upheld the Assessor’s valuation. Signatures: Rich Holtrop (Chair); Crystal Carter (Clerk of the Board).",
    "source_file": "24-186.pdf_page1.png"
  },
  {
    "hearing_date": "null",
    "petition_number": "null",
    "decision": "null",
    "value_reduction": 0,
    "notes": "NOTICE: This order can be appealed to the State Board of Tax Appeals by filing a notice of appeal with them at P.O. Box 40915, Olympia, Washington 98504-0915, within thirty days of the date of mailing this order. The notice of appeal form is available from the Skagit County Assessor, the Skagit County Board of Equalization Office, or the State Board of Tax Appeals and online at: bta.state.wa.us",
    "source_file": "24-338.pdf_page2.png"
  },
  {
    "hearing_date": "April 1, 2025",
    "petition_number": "24-069",
    "decision": "Board of Equalization unanimously upholds the Assessor's valuation (no reduction).",
    "value_reduction": 0,
    "notes": "Petitioner present at the April 1, 2025 hearing. Parcel No: P66881. Owner: 33072 Properties LLC (Attn: Clark Shaefer). Property: residential home on ~0.23 acres located at 33072 West Shore Drive, Mount Vernon, Skagit County, WA. Assessor's value: Land $373,500; Improvements $1,050,200; Total $1,423,700. BOE value determination mirrors assessor's values: Land $373,500; Improvements $1,050,200; Total $1,423,700. The Board members present were Rich Holtrup, Betta Spinelli, and John Rantscher. The order notes the petitioner’s appeal and that the Board upholds the current valuation; The order can be appealed to the State Board of Tax Appeals. Signatures: Rich Holtrup, Chair; Crystal Carter, Clerk of the Board. The document is dated April 11, 2025; Mailed date not filled in.",
    "source_file": "24-069.pdf_page1.png"
  },
  {
    "hearing_date": "April 17, 2025",
    "petition_number": "24-322",
    "decision": "The Skagit County Board of Equalization unanimously upheld the Assessor's value; petition withdrawn during testimony.",
    "value_reduction": 0,
    "notes": "Owner: Mercy Galindo. Property address: 20144 Gina Marie Lane, Burlington, Skagit County, Washington. Parcel No: P99917. The petitioner was present via Zoom at the April 17, 2025 hearing. The property is described as a residential home on 29 acres. Petitioner provided no market evidence; the Assessor was represented by Deputy Assessor Brian Herring and Doug Webb. BOE members present: Rich Holtro p, Angie Bossarte, Betta Spinelli. The petitioner withdrew the petition during testimony; Board unanimously upheld the Assessor. Dated: April 21, 2025. Mailed: Crystal Carter, Clerk of the Board. Signatures: Rich Holtro p, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-322.pdf_page1.png"
  },
  {
    "hearing_date": "April 24, 2025",
    "petition_number": "24-199",
    "decision": "BOE VALUE DETERMINATION",
    "value_reduction": 0,
    "notes": "Petitioner Andrew Holmstrom attended the April 24, 2025 hearing. Property described as residential on 1 acre located at 23827 Brightwood Lane, Sedro Woolley, Skagit County, Washington. Assessor's values: Land $219,300; Improvements $774,700; Total $994,000. BOE value determination matched assessor's values; no reduction. The burden of proof is on the petitioner to provide clear, cogent, and convincing evidence; the petitioner did not submit sufficient evidence to overcome the evidentiary standard. The board unanimously upheld the assessor. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board. Notice of appeal rights included.",
    "source_file": "24-199.pdf_page1.png"
  },
  {
    "hearing_date": "2025-01-23",
    "petition_number": "24-301",
    "decision": "Board of Equalization unanimously upheld the Assessor's value; no reduction granted (assessed/BOE value: 775,200).",
    "value_reduction": 0,
    "notes": "Owner: Cynthia Jackson. Parcel No: P107077. Property: 1916 13th Street, Anacortes, WA 98221 (residential home on ~0.17 acres). Assessor's value: Land 275,000; Improvements 500,200; Total 775,200. BOE value determination: 775,200. The petitioner was not present at the January 23, 2025 hearing. The appraiser notes Zillow estimate is $40,000 less than assessed value. Board signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-301.pdf_page1.png"
  },
  {
    "hearing_date": "March 26, 2025",
    "petition_number": "24-339",
    "decision": "The Board unanimously upheld the Assessor's valuation; no reduction.",
    "value_reduction": 0,
    "notes": "Petitioner was not present at the March 13, 2025 hearing. Property described as a residential home on 10.7 acres located at 18123 Best Road, Mount Vernon, Skagit County. Parcel No: P121737; Petition No: 24-339.",
    "source_file": "24-339.pdf_page1.png"
  },
  {
    "hearing_date": "April 24, 2025",
    "petition_number": "24-087",
    "decision": "Board unanimously upholds the Assessor's valuation; no further reduction granted.",
    "value_reduction": 0,
    "notes": "Petitioner was not present at the April 24, 2025 hearing. Property described as vacant land parcel of .44 acres, contiguous with residential property located at 28601 South Skagit Highway, Sedro Woolley, Skagit County, Washington. The appraiser notes it is a stream in H2O all year; approximately 75 ft lower than other properties in the area. The Assessor testified that a 35% downward adjustment for flooding issues is already in place. The Board sustained the current valuation after considering the evidence. BOE members present: Rich Holtrop (Chair), Angie Bossarte, Betta Spinelli. Parcel No: P131864. Dated: April 30, 2025.",
    "source_file": "24-087.pdf_page1.png"
  },
  {
    "hearing_date": "May 7, 2025",
    "petition_number": "24-036",
    "decision": "Board of Equalization upheld the Assessor's valuation of $615,000 (Land $158,800; Improvements $456,200).",
    "value_reduction": 0,
    "notes": "Owner: William & Wendy Self. Property: 34333 Hamilton Cemetery Road, Sedro Woolley, WA 98284. Parcel No: P67276. The petitioner was not present at the April 29, 2025 hearing. The Assessor recommended sustaining current valuation. The BOE unanimously upheld the Assessor's valuation; total assessed value remains $615,000 (Land $158,800; Improvements $456,200).",
    "source_file": "24-036.pdf_page1.png"
  },
  {
    "hearing_date": "null",
    "petition_number": "null",
    "decision": "null",
    "value_reduction": 0,
    "notes": "Image shows only a general NOTICE about appealing the order from Skagit County Board of Equalization; no case-specific data (hearing_date, petition_number, owner_name, property_address, or decision) is present.",
    "source_file": "24-189.pdf_page2.png"
  },
  {
    "hearing_date": "March 12, 2025",
    "petition_number": "24-165",
    "decision": "The Board unanimously upholds the Assessor.",
    "value_reduction": 0,
    "notes": "Owner: Joe & Rollyn Rose. Property address: 6295 South Shore Road, Anacortes, Skagit County, Washington. The petitioner was not present at the February 27, 2025 hearing. Property described as a residential home on 7.09 acres. Appellant argued the increase and referenced Guemes Island Road as a comparator, claiming a 36.5% increase did not reflect fair market value; handicap lift ($32,000) added for a disabled resident/owner. Assessor's values: Land $532,300; Improvements $1,165,000; Total $1,697,300. BOE value determination: Land $532,300; Improvements $1,165,000; Total $1,697,300. The Board found insufficient evidence to justify a reduction and upheld the Assessor. Signed by Rich Holtrp, Chair (Board); Clerk: Crystal Carter.",
    "source_file": "24-165.pdf_page1.png"
  },
  {
    "hearing_date": "April 9, 2025",
    "petition_number": "24-360",
    "decision": "The Board overruled the Assessor and assigned a new total assessed value of $235,000.",
    "value_reduction": 56600,
    "notes": "Owner name: Matthews Credit Shelter Trust. Petitioner: Scott Matthews; Parcel No: P31053. Property: residential home on 2.2 acres located at 15534 State Route 530, Concrete, Skagit County, Washington. Mailing address: Attn: Scott Matthews, 12730 291st Ave NE, Duvall, WA 98019. The Assessor's value (TOTAL): $291,600 (Land $150,400; Improvements $141,200). The BOE value (TOTAL): $235,000 (Land $150,400; Improvements $84,600). The petitioner was present at the hearing. The order notes the hearing date, the petition number, the parcel, and references that the Board overruled the Assessor and set the new value. For appeal, notice procedures are included in the document (Board of Equalization, Skagit County).",
    "source_file": "24-360.pdf_page1.png"
  },
  {
    "hearing_date": "May 1, 2025",
    "petition_number": "24-131",
    "decision": "Board upholds Assessor's value",
    "value_reduction": 0,
    "notes": "Property described as a vacant land parcel on 5.29 acres located in Sedro Woolley, Skagit County, Washington. The Assessor's Value: Land $239,900; Improvements $0; Total $239,900. BOE value determination mirrors assessor's value. The petitioner, JoAnn Gustafson, did not submit sufficient evidence to support a reduction; the Board unanimously upheld the assessor's valuation.",
    "source_file": "24-131.pdf_page1.png"
  },
  {
    "hearing_date": "April 30, 2025",
    "petition_number": "24-086",
    "decision": "Board of Equalization upheld the Assessor's valuation; no value reduction.",
    "value_reduction": 0,
    "notes": "Petitioner was not present at the hearing. Property described as a vacant land parcel of 4.56 acres, contiguous with the residential property located at 28601 South Skagit Highway, Sedro-Woolley, Skagit County, Washington. Assessor's value: LAND $23,400; IMPROVEMENTS $0; TOTAL $23,400. BOE value determination matched the assessor's value with no downward adjustments. The Board unanimously upheld the Assessor.",
    "source_file": "24-086.pdf_page1.png"
  },
  {
    "hearing_date": "March 6, 2025",
    "petition_number": "24-031",
    "decision": "Board of Equalization upheld the assessor's value (land $362,500; improvements $387,500; total $750,000).",
    "value_reduction": 0,
    "notes": "Petitioner: Cary Varas & Stephanie Garza; Parcel No: P57920. Property: 1206 33rd Street, Anacortes, WA 98221. The petitioner was not present at the March 6, 2025 hearing. The BOE decision upholds the 2024 assessed value of $750,000.",
    "source_file": "24-031.pdf_page1.png"
  },
  {
    "hearing_date": "February 13, 2025",
    "petition_number": "24-113",
    "decision": "Board of Equalization upholds the Assessors' value (no reduction).",
    "value_reduction": 0,
    "notes": "Property owner/petitioner: Ownwell, Inc.; Petitioner's representative: Tara Nelson. Parcel No: P70193. Property: residential home on ~0.3 acres located at 12113 Hilynn Drive, Burlington, Skagit County, Washington. Assessor's value – Land $251,100; Improvements $395,200; Total $646,300. BOE value determination matches Assessor's value (no decrease). The Board unanimously upheld the Assessor. The order is dated February 24, 2025. Notice: appeal possible to State Board of Tax Appeals.",
    "source_file": "24-113.pdf_page1.png"
  },
  {
    "hearing_date": "April 3, 2025",
    "petition_number": "24-076",
    "decision": "BOE value determination: Upheld the Assessor's value; Total value $750,800 (Land $208,200; Improvements $542,600).",
    "value_reduction": 0,
    "notes": "Owner: Oleg Kartsanov. Property: 19716 Melody Lane, Mount Vernon, WA 98274. Parcel No: P29496. The petitioner was not present at the March 20, 2025 hearing. The Board unanimously upheld the Assessor's value (land and improvements equal to the assessor values: $208,200 and $542,600 respectively; total $750,800). The property described as a residential home on .58 acres; appellant cited septic/water issues, but no evidence to support a value change.",
    "source_file": "24-076.pdf_page1.png"
  },
  {
    "hearing_date": "March 3, 2025",
    "petition_number": "24-187 & 24-188",
    "decision": "No reduction; BOE value determined equals the Assessor's value for all parcels; petitioner did not meet the evidentiary standard to overturn the assessor.",
    "value_reduction": 0,
    "notes": "Petitioner: Stephen Sziebert. Parcels: P20371, P113469, P113470. Property described as three parcels of land on a combined 2.5 acres located on Gibraltar Road, Anacortes, Skagit County, Washington. The appellant purchased the three parcels in 2023; all three parcels are raw land with no utilities installed; bluff with a 50 ft setback; waterfront is inaccessible. Hearing date listed on the order is March 3, 2025; petitioner was present at the February 20, 2025 hearing. Assessor’s values: Parcel P20371 land 334,300; improvements 0; total 334,300. Parcel P113469 land 284,100; improvements 0; total 284,100. Parcel P113470 land 71,200; improvements 0; total 71,200. BOE value determinations matched the assessor’s values for all parcels (no reductions). The file discusses significant reductions claimed by the assessor (20% for topography and 30% for increased development costs) and notes the assessor requests the board sustain the current evaluation. The board ultimately sustained the current evaluation. The case status is described as currently with Washington BTA under docket numbers 103307 and 103306.>",
    "source_file": "24-188.pdf_page1.png"
  },
  {
    "hearing_date": "April 3, 2025",
    "petition_number": "24-216",
    "decision": "The Board of Equalization unanimously upheld the Assessor's value (no change to total value).",
    "value_reduction": 130000,
    "notes": "Owner name: Julie Harris. Property address: 700 W Blackburn Road, Mount Vernon, Skagit County, Washington. The petitioner was not present at the March 20, 2025 hearing. Assessor's Value: Land $223,600; Improvements $340,700; Total $399,800. BOE Value Determination: Land $223,600; Improvements $210,700; Total $399,800. The reduction occurred in Improvements, amounting to $130,000. Parcel No: P96176. Petition No: 24-216. Board members present: Rich Holtorp, Angie Bossarte, Betta Spinelli. Signatures: Rich Holtorp (Chair); Crystal Carter (Clerk).",
    "source_file": "24-216.pdf_page1.png"
  },
  {
    "hearing_date": "May 13, 2025",
    "petition_number": "24-168",
    "decision": "Board unanimously upholds the Assessor's value; no reduction",
    "value_reduction": 0,
    "notes": "Parcel No: P131505. Petitioner: Darla & Paul Lamb. Property: 40371 Bates Lane, Concrete, WA 98237. Assessor's Value: Land $147,000; Improvements $379,800; Total $526,800. BOE Value Determination matches Assessor: $526,800 total. The petitioner was not present at the May 8, 2025 hearing. Property described as residential on 1 acre. Appellant claims a carport added valued at $39,500; no garage or shop added. The Assessor did not provide a response due to lack of evidence. BOE members present: Rich Holtrop, Angie Bossarte, Betta Spinelli. The Board upheld the assessor after considering the evidence.",
    "source_file": "24-168.pdf_page1.png"
  },
  {
    "hearing_date": "March 6, 2025",
    "petition_number": "24-135",
    "decision": "The Board unanimously upholds the Assessor's valuation for the property.",
    "value_reduction": 0,
    "notes": "Owner: Thomas Bugge. Property: 5129 Guemes Island Road, Anacortes, WA 98221. Assessor's values - LAND $752,200; IMPROVEMENTS $577,000; TOTAL $1,329,200. The petitioner was not present at the March 6, 2025 hearing. Appellant cited Parcel P61713 sold on July 3 for $650,000 as a lot; the Board found the evidence insufficient to support a reduction and upheld the assessor's valuation. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-135.pdf_page1.png"
  },
  {
    "hearing_date": "February 27, 2025",
    "petition_number": "24-080",
    "decision": "Board of Equalization upheld the Assessor's value; no change to assessed value",
    "value_reduction": 0,
    "notes": "Owner: Arsene De Conde. Property: 14055 Madrona Drive, Anacortes, Skagit County, Washington. Parcel No: P6994. Assessor's Value: Land $212,000; Improvements $465,600; Total $677,600. BOE Value: Land $212,000; Improvements $465,600; Total $677,600. The petitioner was not present at the February 20, 2025 hearing. The Assessor, represented by Deputy Assessor Brian Herring and Doug Webb, did not provide a response due to lack of evidence. BOE members present: Rich Holtrop, Angie Bossarte, Betta Spinelli. The burden of proof rests with the petitioner, who did not submit sufficient evidence to support a reduction. Upon motion, the Board unanimously upheld the Assessor. Signed by Rich Holtrop (Chair) and Crystal Carter (Clerk of the Board).",
    "source_file": "24-080.pdf_page1.png"
  },
  {
    "hearing_date": "April 1, 2025",
    "petition_number": "24-040",
    "decision": "BOE upholds assessor value: Land $575,800; Improvements $1,861,700; Total $2,437,500",
    "value_reduction": 0,
    "notes": "Petitioner: Mary Kay Going. Parcel No: P74678. Property described as residential on 0.73 acres located at 17298 Lake View Boulevard, Mount Vernon, Skagit County, WA. Assessor's values: Land $575,800; Improvements $1,861,700; Total $2,437,500. BOE determination matches assessor's value; Board unanimously upheld the Assessors valuation. Petitioner's mailing address: 18398 S West View Road, Mount Vernon, WA 98274. Petition No.: 24-040. Signatures: Rich Holtrp, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-040.pdf_page1.png"
  },
  {
    "hearing_date": "2025-04-01",
    "petition_number": "24-120",
    "decision": "The Skagit County Board of Equalization upheld the Assessor's valuation; no reduction in value.",
    "value_reduction": 0,
    "notes": "Petitioner John Cole was not present at the April 1, 2025 hearing. Property described as residential home on ~0.17 acres located at 1202 Bradley Court, Burlington, Skagit County, Washington. Parcel Numbers involved: P84032, P84029, P84022. Assessor's values: Land 221,400; Improvements 270,600; Total 492,000. BOE Value Determination matched the Assessor's values (Land 221,400; Improvements 270,600; Total 492,000). The document discusses prior year assessments for related parcels (2021 and 2023). The Board's order dated April 10, 2025; signed by Rich Holtrop, Chair.",
    "source_file": "24-120.pdf_page1.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "",
    "value_reduction": 0,
    "notes": "NOTICE: This order can be appealed to the State Board of Tax Appeals by filing a notice of appeal with them at P.O. Box 40915, Olympia, Washington 98504-0915, within thirty days of the date of mailing this order. The notice of appeal form is available from the Skagit County Assessor, the Skagit County Board of Equalization Office, or the State Board of Tax Appeals and online at: bta.state.wa.us",
    "source_file": "24-330.pdf_page2.png"
  },
  {
    "hearing_date": "2025-03-12",
    "petition_number": "24-324",
    "decision": "Board unanimously upheld the Assessor's value (no reduction).",
    "value_reduction": 0,
    "notes": "Petitioner: Christopher Pforr; Parcel No: P66087. Property: residential home on 0.4 acres at 7740 Cypress Way, Anacortes, WA 98221 (Skagit County). Assessor's value: LAND $425,800; IMPROVEMENTS $158,600; TOTAL $584,400. BOE value determination identical. The petitioner was not present at the February 27, 2025 hearing. The Board notes the hearing date as March 12, 2025 and upholds the assessor. Signatures: Rich Holtrup, Betta Spinelli, John Rantschler (Board members) with Clerk signatures on the document.",
    "source_file": "24-324.pdf_page1.png"
  },
  {
    "hearing_date": "February 27, 2025",
    "petition_number": "24-171",
    "decision": "Board unanimously upheld the Assessor's current evaluation (no reduction).",
    "value_reduction": 0,
    "notes": "Owner: Jonathan & Sandra Prescott. Property: 7133 Glencoe Lane, Anacortes, WA 98221. Assessed values: Land $178,500; Improvements $926,800; Total $1,105,300. The petitioner was not present at the February 27, 2025 hearing. The BOE described the property as a residential home on 3.1 acres; discussed comparable sales and supported maintaining the current assessment. Board members: Rich Holtrop (Chair), Betta Spinelli, John Rantschler. Dated March 12, 2025. Mailed to Crystal Carter, Clerk of the Board. Notice of appeal rights provided.",
    "source_file": "24-171.pdf_page1.png"
  },
  {
    "hearing_date": "March 20, 2025",
    "petition_number": "24-170",
    "decision": "Board of Equalization upholds the Assessor's value; no reduction.",
    "value_reduction": 0,
    "notes": "Petitioner not present at the March 20, 2025 hearing. Property described as residential home on 0.18 acres located at 2306 Cedar Court, Mount Vernon, Skagit County, Washington. Parcel No P80190; Petition No 24-170. Assessor's values: Land 219,700; Improvements 216,300; Total 436,000. Board found petitioner failed to provide evidence; burden of proof on petitioner. Board members present: Rich Holtrup, Angie Bossarte, Betta Spinelli. Order upheld the Assessor's determination. Signatures: Rich Holtrop (Chair); Crystal Carter (Clerk of the Board).",
    "source_file": "24-170.pdf_page1.png"
  },
  {
    "hearing_date": "null",
    "petition_number": "null",
    "decision": "null",
    "value_reduction": 0,
    "notes": "The provided image contains only a general NOTICE about appealing to the State Board of Tax Appeals; no specific hearing details (hearing date, petition number, owner name, property address, or decision/value reduction) are present.",
    "source_file": "24-029.pdf_page2.png"
  },
  {
    "hearing_date": "",
    "petition_number": "",
    "decision": "",
    "value_reduction": 0,
    "notes": "Page contains only a notice about appealing to the State Board of Tax Appeals and provides contact details for Skagit County Assessor/Board of Equalization and the State Board; no hearing date, petition number, owner name, property address, or decision/value reduction information present on the page.",
    "source_file": "24-194.pdf_page2.png"
  },
  {
    "hearing_date": "February 6, 2025",
    "petition_number": "24-061",
    "decision": "Board unanimously upholds the Assessor's valuation.",
    "value_reduction": 0,
    "notes": "Parcel No P59053. Property: residential home on 0.21 acres located at 5610 Kingsway, Anacortes, Skagit County, WA. Assessor's value: Land $240,000; Improvements $414,600; Total $654,600. BOE value determination: $240,000 land, $414,600 improvements, total $654,600 (same as assessor). Petitioner: Cynthia Douglas. The petitioner was not present at the February 6, 2025 hearing. The Board unanimously upheld the Assessor's valuation.",
    "source_file": "24-061.pdf_page1.png"
  },
  {
    "hearing_date": "March 25, 2025",
    "petition_number": "24-197",
    "decision": "Overruled the Assessor two to one; new assessed value $1,823,700",
    "value_reduction": 30000,
    "notes": "Petitioner: Stephen Brinigar Trust. Property: 5 Beach Drive, Unit A, La Conner, WA 98257 (parcel no: P15200). Original assessor's value: Land $657,900; Improvements $1,195,800; Total $1,853,700. BOE value determination: Land $657,900; Improvements $1,165,800; Total $1,823,700. The petitioner's hearing occurred March 13, 2025; order dated March 25, 2025. The Board overruled the assessor two-to-one, resulting in a new total value of $1,823,700 and a $30,000 reduction due to unfinished basement and an overstatement of square footage by 650 sq ft. Property described as residential on 2.51 acres; notable records include sale history (sold for $850,000 in June 2018) and prior appraisals. Board members: Rich Holtrop (Chair), Angie Bossarte, Betta Spinelli. Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-197.pdf_page1.png"
  },
  {
    "hearing_date": "March 17, 2025",
    "petition_number": "24-150",
    "decision": "Upon motion duly made and seconded, the Skagit County Board of Equalization unanimously upholds the Assessor.",
    "value_reduction": 0,
    "notes": "Property described as a residential home on ~0.4 acres located at 7764 Cypress Way, Anacortes, Skagit County, Washington. Appellant/owner: Taunya Sell; two parcels, P66089 and P66088, of the same size. Assessed value: Land $464,000; Improvements $593,800; Total $1,057,800 (BOE value determination identical). Appellant contends the two parcels have different land values (one cited at $406,000 and the other at $146,000) and notes purchase of both parcels in 2020 for $750,000. The next-door neighbor with a smaller property has not sold for over 200 days for $1.2 million. The BOE notes that P66088 is listed as not developable and used for water share; the Assessor maintains market-based evidence supports the current assessment. BOE members present: Rich Holtrop (Chair); Angie Bossarte; Betta Spinelli. The burden of proof rests with the petitioner; no market evidence submitted to support a reduction. The order states the Board unanimously upholds the Assessor.",
    "source_file": "24-150.pdf_page1.png"
  },
  {
    "hearing_date": "May 1, 2025",
    "petition_number": "24-192",
    "decision": "The Board unanimously upholds the Assessor.",
    "value_reduction": 0,
    "notes": "Petitioner was not present at the April 24, 2025 hearing. Property described as a vacant land parcel of 5 acres located at TR 18 Prairie Lane Meadows, Sedro Woolley, Skagit County, Washington. Appellant cited Skagit County Comparable Sales data for vacant land for the previous three years, noting an average land price per acre of approximately $29,072. The Assessor, represented by Deputy Assessor Brian Herring and Doug Webb, provided market evidence; the Board sustained the Assessor. Signed by Rich Holtrop, Chair, and Crystal Carter, Clerk of the Board.",
    "source_file": "24-192.pdf_page1.png"
  },
  {
    "hearing_date": "April 17, 2025",
    "petition_number": "24-126",
    "decision": "BOE upplied the Assessor's valuation of $169,000 (LAND) with no reductions; total value $169,000.",
    "value_reduction": 0,
    "notes": "Parcel No: P48780. Property described as vacant land on 7.4 acres located on Bow Hill Road, Bow, Skagit County, Washington. Petitioner: Brian Weems; Petitioner did not appear at the April 17, 2025 hearing. Assessor's value: LAND $169,000; IMPROVEMENTS $0; TOTAL $169,000. BOE value determination: LAND $169,000; IMPROVEMENTS $0; TOTAL $169,000. Dated: April 21, 2025. Board: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-126.pdf_page1.png"
  },
  {
    "hearing_date": "February 27, 2025",
    "petition_number": "24-353",
    "decision": "New assessed value assigned: $570,000 (Board overruled Assessor's value).",
    "value_reduction": 29800,
    "notes": "Owner: William & Marilyn Rietzel. Property: 1811 Cedar Springs Lane, Anacortes, Skagit County, WA (condominium). Parcel No: 117548. Assessor's Value: Land $275,600; Improvements $324,200; Total $599,800. BOE value determination: Land $275,600; Improvements $294,400; Total $570,000. The petitioner was not present at the February 27, 2025 hearing. The appellant cites comps: Comp 1 – 1806 Cedar Springs Lane, 2 bed, 2 bath, 1,318 sq ft; market $567,500; sold $548,000 (2024-08-01). Comp 2 – 1810 Cedar Springs Lane, 3 bed, 2 bath, 1,553 sq ft; sold in 2024 for $665,000. The property is stated as the smallest unit in the community with no backyard. The Board overruled the Assessor and assigned a new assessed value of $570,000. Dated: (not provided). Signatures: Rich Holtrop, Chair; Crystal Carter, Clerk of the Board.",
    "source_file": "24-353.pdf_page1.png"
  }
]